Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: %s: Convection in centered blending with %f percent of upwind
fr: %s : Convection en blending centré avec %f pourcent d'upwind

source: %s: Convection in 2nd order blending with %f percent of upwind
fr: %s : Convection en blending d'ordre 2 avec %f pourcent d'upwind

source: invalid value of ischcp
fr: valeur invalide pour ischcp

source: %s: %llu Faces with upwind on %llu interior faces
fr: %s : %llu Faces avec upwind sur %llu faces intérieures

source: invalid value of icvflb and f_id
fr: valeur invalide pour icvflb et f_id

source: invalid value of init
fr: valeur invalide pour init

source: Iterative reconstruction
fr: Reconstruction itérative

source: Least-squares (standard)
fr: Moindres carrés (standard)

source: Least-squares (extended)
fr: Moindres carrés (support étendu)

source: Least-squares (partially extended)
fr: Moindres carrés (support partiellement étendu)

source: Least-squares then iterative
fr: Moindres carrés puis itérative

source: Summary of gradient computations pour "%s" (%s): Number of calls: %12d Total elapsed time: %12.3f
fr: Bilan des calculs de gradient pour "%s" (%s) : Nombre d'appels : %12d Temps écoulé cumulé : %12.3f

source: Gradient limitation in %llu cells minimum factor = %14.5e; maximum factor = %14.5e
fr: Limitation de gradient en %llu cellules facteur minimum = %14.5e ; facteur maximum = %14.5e

source: %s; variable: %s; converged in %d sweeps %*s normed residual: %11.4e; norm: %11.4e
fr: %s; variable : %s; convergée en %d itération(s) %*s résidu normé : %11.4e; norme : %11.4e

source: Warning: -------- %s; variable: %s; sweeps: %d %*s normed residual: %11.4e; norm: %11.4e
fr: Attention : --------- %s; variable: %s; itérations : %d %*s résidu normé : %11.4e; norme : %11.4e

source: Gradient of a vector limitation in %llu cells minimum factor = %14.5e; maximum factor = %14.5e
fr: Limitation de gradient de vecteur en %llu cellules facteur minimum = %14.5e ; facteur maximum = %14.5e

source: %s: isweep = %d, normed residual: %e, norm: %e, var: %s
fr: %s: isweep = %d, norme du résidu : %e, norme : %e, var = %s

source: algebraic, natural face traversal
fr: algébrique, faces dans l'ordre naturel

source: algebraic, face traveral by criteria
fr: algébrique, faces ordonnées par critère

source: algebraic, face traversal by Hilbert SFC
fr: algébrique, faces ordonnées par courbe de Hilbert

source: Connectivity error: Face %d has same cell %d on both sides.
fr: Erreur de connectivité : La face %d voit la cellule %d des deux cotés.

source: Tuning for coarse matrices of level %d and type: %s ==========================
fr: Réglage pour matrices grossières de niveau %d et type : %s ================================

source: Multigrid rank merge parameters: merge rank stride: %d mean coarse cells merge threshold: %d total coarse cells merge threshold: %llu minimum active ranks: %d
fr: Paramètres multigrille de regroupement de rangs: nombre de rangs par regroupement: %d nombre moyen limite de cellules grossières: %d nombre total limite de cellules grossières: %llu nombre minimum de rangs actifs: %d

source: diagonal + faces
fr: diagonale + faces

source: Assigning non-symmetric matrix coefficients to a matrix in a symmetric CSR format.
fr: Affectation de coefficients matriciels non symétriques à une matrice en stockage CSR symmétrique.

source: Handling of matrixes in %s format is not operational yet.
fr: La gestion des matrices au format %s n'est pas encore opérationnelle.

source: The matrix is not defined.
fr: La matrice n'est pas définie.

source: Matrix.vector product function type "%s" is not available in this build.
fr: La fonction de produit matrice.vecteur de type "%s" n'est pas disponible dans cette installation.

source: Checking matrix structure and operation variants (diff/reference): ------------------------------------------------
fr: Test de variantes de structures et opérations matricielles (diff/référence) : ---------------------------------------------------------------------------

source: Tuning for matrices of type: %s ===========================
fr: Réglage pour des matrices de type : %s ===================================

source: scalar symmetric
fr: scalaires symmétriques

source: block diagonal
fr: à diagonale bloc

source: block diagonal symmetric
fr: symmétriques à diagonale bloc

source: block
fr: par blocs

source: matrix %s coefficients assign
fr: affectation des coefficients matriciels %s

source: matrix structure creation/destruction
fr: création/destruction de la structure de la matrice

source: time (s)
fr: temps (s)

source: mean
fr: moyen

source: %s : %d ranks
fr: %s : %d rangs

source: Elapsed tuning time: %12.3f s.
fr: Temps de réglage écoulé : %12.3f s.

source: Dump of matrixes in %s format is not operational yet.
fr: L'impression des matrices au format %s n'est pas encore opérationnelle.

source: Extraction of diagonal dominance of matrixes in %s format is not operational yet.
fr: L'extraction de la diagonale dominance de matrices au format %s n'est pas encore opérationnelle.

source: Solver type: multigrid Coarsening type: %s Max fine cells per coarse cell: %d Maximum number of levels : %d Minimum number of coarse cells: %llu P0/P1 relaxation parameter: %g Maximum number of cycles: %d
fr: Type de solveur : multigrille Type de regroupement : %s Taille de regroupement maximal : %d Nombre maximal de niveaux : %d N. min. de cellules grossières : %llu Paramètre de relaxation P0/P1 : %g Nombre maximum de cycles : %d

source: %s: Type: %s Preconditioning:
fr: %s: Type: %s Préconditionnement :

source: none
fr: aucun

source: polynomial, degree %d
fr: polynômial, degré %d

source: Maximum number of iterations: %d Precision multiplier: %g
fr: Nombre d'itérations maximal : %d Multiplicateur de précision : %g

source: Postprocess coarsening: %d
fr: Post-traitement de l'aggrégation : %d

source: Resolution:
fr: Résolution :

source: build:
fr: construction :

source: solve:
fr: résolution :

source: descent smoothe:
fr: lissage descendant :

source: ascent smoothe:
fr: lissage ascendant :

source: restrict:
fr: restriction :

source: prolong:
fr: prolongement :

source: Multigrid: Coarsening: %s
fr: Multigrille : Aggrégation : %s

source: Smoother: %s
fr: Lisseur : %s

source: Descent smoother: %s Ascent smoother: %s
fr: Lisseur de descente : %s Lisseur de remontée : %s

source: Coarsest level solver: %s
fr: Solveur de niveau grossier : %s

source: Number of coarse levels:
fr: Nombre de niveaux grossiers :

source: Number of cycles:
fr: Nombre de cycles :

source: Number of cells:
fr: Nombre de cellules :

source: Grid level %d: %s %12llu %12llu %12llu
fr: Grille niveau %d : %s %12llu %12llu %12llu

source: Number of faces:
fr: Nombre de faces :

source: Number of active ranks:
fr: Nombre de rangs actifs :

source: Mean local cells:
fr: Nombre local moyen de cellules :

source: Mean local cells + ghosts:
fr: Nombre local moyen cell. + halos :

source: Mean local faces:
fr: Nombre local moyen de faces :

source: Cells unbalance:
fr: Déséquilibre cellules :

source: Cells + ghosts unbalance:
fr: Déséquilibre cellules + halos :

source: Faces unbalance
fr: Déséquilibre faces :

source: Iterations for solving:
fr: Itérations pour la résolution:

source: Descent smoother iterations:
fr: Itérations lisseur de descente :

source: Ascent smoother iterations:
fr: Itérations lisseur de montée :

source: Grid level %d:
fr: Grille niveau %d :

source: --------------------------------------------------- n. | Cumulative iterations | Norm. residual cycles | on fine mesh | on fine mesh ---------------------------------------------------
fr: --------------------------------------------------- nb. | Cumul des iterations | Residu norm. cycles | sur maillage fin | maillage fin ---------------------------------------------------

source: N. cycles: %4d; Fine mesh cumulative iter: %5d; Norm. residual %12.4e
fr: Nb. cycles : %4d ; Cumul iter maillage fin : %5d ; Residu norme %12.4e

source: @@ Warning: algebraic multigrid for [%s] ******** Maximum number of cycles (%d) reached.
fr: @@ Attention : multigrille algébrique pour [%s] ********* Nombre de cycles maximal (%d) atteint

source: Multigrid cycle: descent
fr: Cycle multigrille : descente

source: level %3d: smoother
fr: niveau %3d : lisseur

source: Resolution on coarsest level
fr: Résolution sur le niveau le plus grossier

source: Multigrid cycle: ascent
fr: Cycle multigrille : remontée

source: Construction of grid hierarchy for "%s"
fr: Construction de la hiérarchie de grilles pour "%s"

source: building level %2d grid
fr: construction de la grille de niveau %2d

source: total min max number of cells: %12llu %10d %10d number of faces: %10d %10d
fr: total min max nombre de cellules : %12llu %10d %10d nombre de faces : %10d %10d

source: number of cells: %10d number of faces: %10d
fr: nombre de cellules : %10d nombre de faces : %10d

source: number of coarse grids: %d number of cells in coarsest grid: %llu
fr: nombre de maillages grossiers : %d nombre de cellules dans le maillage le plus grossier : %llu

source: Multigrid [%s]:
fr: Multigrille [%s]:

source: Multigrid [%s]: cycle %4d
fr: Multigrille [%s] : cycle %4d

source: algebraic multigrid [%s]: %s after %d cycles: initial residual: %11.4e; current residual: %11.4e
fr: multigrille algébrique [%s] : %s après %d cycles : résidu initial : %11.4e ; résidu courant : %11.4e

source: algebraic multigrid [%s]: %s after %d cycles during resolution at level %d: initial residual: %11.4e; current residual: %11.4e
fr: multigrille algébrique [%s] : %s après %d cycles : au cours de la résolution au niveau %d: résidu initial : %11.4e ; résidu courant : %11.4e

source: [%s]: immediate exit; r_norm = %11.4e, residual = %11.4e
fr: [%s]: sortie immédiate ; r_norm = %11.4e, residu = %11.4e

source: Linear solver options modified during run (previous values)
fr: Options de solveurs linéaires modifiées au cours du calcul (valeurs précédentes)

source: Linear solver options for fields
fr: Options de solveurs linéaires pour les champs

source: Linear solver options for other systems
fr: Options de solveurs linéaires pour les autres systèmes

source: Linear solver performance with previous options
fr: Performance des solveurs linéaires avec options précédetes

source: Linear solver performance for fields
fr: Performance des solveurs linéaires pour les champs

source: Linear solver performance for other systems
fr: Performance des solveurs linéaires pour les autres systèmes

source: Linear solver options for "%s" (field id %d)
fr: Options de solveur linéaire pour le champ "%s" (id %d)

source: Linear solver options for "%s"
fr: Options de solveur linéaire pour le système "%s"

source: Summary of resolutions for "%s" (field id %d)
fr: Bilan des résolutions pour le champ "%s" (id %d)

source: Summary of resolutions for "%s"
fr: Bilan des résolutions pour le système "%s"

source: Verbosity: %d
fr: Verbosité : %d

source: Number of immediate solve exits: %d
fr: Nombre de sorties de résolution immédiates : %d

source: Conjugate gradient
fr: Gradient conjugué

source: %s [%s]: divergence after %u iterations: initial residual: %11.4e; current residual: %11.4e
fr: %s [%s] : divergence après %u itérations : résidu initial : %11.4e ; résidu courant : %11.4e

source: @@ Warning: non convergence
fr: @@ Attention : non convergence

source: %s [%s]: @@ Warning: non convergence norm of coefficient "%s" is lower than %12.4e The resolution does not progress anymore.
fr: %s [%s]: @@ Attention : non convergence La norme du coefficient "%s" est inférieure à %12.4e La résolution ne progresse plus.

source: Solver type: %s Preconditioning:
fr: Type de solveur : %s Préconditionnement :

source: Maximum number of iterations: %d
fr: Nombre d'itérations maximal : %d

source: Solver type: %s Number of setups: %12d Number of calls: %12d Minimum number of iterations: %12d Maximum number of iterations: %12d Mean number of iterations: %12d Total setup time: %12.3f Total solution time: %12.3f
fr: Type de solveur : %s Nombre de préparations : %12d Number d'appels : %12d Nombre d'itérations minimal : %12d Nombre d'itérations maximal : %12d Nombre d'itérations moyen : %12d Temps total de préparation : %12.3f Temps total de résolution : %12.3f

source: Usage: %s [options] <file_name> or: %s -d [options] <file_name_1> <file_name_2> Dump headers and optionnaly content of a Code_Saturne Preprocessor, Partitioner, or restart file, or compare two such files. Options: -d, --diff diff mode. -e, --extract extract mode (extract full section data, with no metadata). --f-format <fmt> define format for floating-point numbers (default: "15.9e" for floats, "22.15e" for doubles). --location <id> only output section(s) with given location id. -n <level> number of first and last elements of each section to output (default: print headers only). --section <name> only consider section matching given criteria. --threshold <val> in diff mode, real value above which a difference is considered significant (default: 1e-30). -h, --help this message.
fr: Utilisation : %s [options] <nom_fichier> ou : %s -d [options] <nom_fichier_1> <nom_fichier_2> Imprime les entêtes et de manière optionnelle le contenu d'un fichier issu du Préprocesseur, du Partitionneur, ou d'un fichier de reprise de calcul, ou comparer deux de ces fichiers. Options : -d, --diff mode différences. -e, --extract mode extraction (extrait une section complète, sans méta-données). --f-format <fmt> format pour les nombres en virgule flottante (défaut "15.9e" pour les "floats", "22.15e" pour les "doubles"). --location <id> limitation aux sections avec id de support indiqué. -n <level> nombre des premiers et derniers éléments de chaque section à sortir (défaut : entêtes uniquement). --section <name> limitation aux sections du nom indiqué. --threshold <val> en mode différences, valeur réelle au dessus de laquelle une différence est considérée significative (défaut : 1e-30). -h, --help ce message.

source: Premature end of file "%s"
fr: Fin de fichier "%s" prématurée.

source: Error reading file "%s"
fr: Erreur à la lecture du fichier "%s"

source: Opening input file: "%s"
fr: Ouverture du fichier d'entrée : "%s"

source: File format of "%s" is not recognized: First %d bytes: "%s".
fr: Format du fichier "%s" non reconnu Premiers %d octets : "%s".

source: File type: %s
fr: Type de fichier : %s

source: Base header size: %d Header alignment: %d Body alignment: %d
fr: Taille d'en-tête par défaut : %d Alignement des en-têtes : %d Alignement des corps : %d

source: Closing input: "%s"
fr: Fermeture de l'entrée : "%s"

source: .----------------------------. | Code_Saturne file dump | `----------------------------'
fr: .------------------------------------. | Analyse de fichier Code_Saturne | `------------------------------------'

source: Type "%s" is not known Known types: "c ", "i4", "i8", "u4", "u8", "r4", "r8".
fr: Type "%s" inconnu Types connus : "c ", "i4", "i8", "u4", "u8", "r4", "r8".

source: Values in header
fr: Valeurs dans l'entête

source: %lu first and last elements:
fr: %lu premiers et derniers éléments :

source: elements:
fr: éléments :

source: Section: "%s" Number of values: %lu
fr: Rubrique : "%s" Nombre d'éléments : %lu

source: Location id: %lu Index id: %lu Values per location: %lu
fr: Id de support : %lu Id d'index : %lu Valeurs par lieu : %lu

source: File "%s" contains multiple sections named "%s" with location id %d
fr: Le fichier "%s" contient plusieurs sections nommées "%s" avec id de support %d

source: "%-32s"; Location: %2lu Size: %llu Type: %-6s; | Type: %-6s;
fr: "%-32s" ; Support : %2lu Taille : %llu Type : %-6s ; | Type : %-6s ;

source: "%-32s"; Location: %2lu; Type: %-6s; Size: %llu
fr: "%-32s" ; Support : %2lu ; Type : %-6s ; Taille : %llu

source: "%-32s"; Location: %2lu; Size: %llu Type: %-6s; | Type: %-6s
fr: "%-32s" ; Support : %2lu ; Taille : %llu Type : %-6s ; | Type : %-6s

source: "%-32s"; Location: %2lu; Type: %-6s Size: %llu | Size: %llu
fr: "%-32s" ; Support : %2lu ; Type : %-6s Taille : %llu | Taille : %llu

source: "%-32s"; Location: %2lu Type: %-6s; Size: %llu | Type: %-6s; Size: %llu
fr: "%-32s" ; Support : %2lu Type : %-6s ; Taille : %llu | Type : %-6s ; Taille : %llu

source: Differences: %llu; Max: %g; Mean: %g
fr: Différences : %llu ; Max : %g ; Moyenne : %g

source: Differences: %llu
fr: Différences : %llu

source: "%-32s"; Type: %-6s; Location: %2lu; Size: %llu
fr: "%-32s" ; Type : %-6s ; Support : %2lu ; Taille : %llu

source: Sections only found in file "%s":
fr: Sections présentes uniquement dans le fichier "%s" :

source: Computing quality criteria
fr: Calcul des critères de qualité

source: Coupling with SYRTHES is not possible in mesh preprocessing or verification mode.
fr: Le couplage avec SYRTHES n'est pas possible en mode de pré-traitement ou vérification de maillage.

source: Destroying structures and ending computation
fr: Destruction des structures et clôture du calcul

source: Shared library support not available. Unable to load: %s
fr: Support de bibliothèques partagées non disponible. Impossible de charger : %s

source: MPI_Alltoall and MPI_Alltoallv
fr: MPI_Alltoall et MPI_Alltoallv

source: Crystal Router algorithm
fr: algorithme "Crystel Router"

source: Exchange:
fr: Échange :

source: Swap source and destination:
fr: Inversion source et destination :

source: Sort by source rank:
fr: Tri par rang source :

source: Copy exchanged data:
fr: Copie de données échangées :

source: Instrumented all-to-all operations (using %s):
fr: Opérations "all-to-all" instrumentées (avec %s):

source: %s %12.5f s, %lu calls
fr: %s %12.5f s, %lu appels

source: Memory allocation summary -------------------------
fr: Résumé de l'allocation mémoire ------------------------------

source: Theoretical current allocated memory: %llu kB
fr: Mémoire dynamique instrumentée théorique : %llu ko

source: Theoretical maximum allocated memory: %llu kB
fr: Mémoire dynamique instrumentée théorique : %llu ko

source: Maximum program memory measure: %llu kB
fr: Mémoire programme mesurée maximale: %llu ko

source: Current program memory measure: %llu kB
fr: Mémoire programme mesurée courante: %llu ko

source: Call stack:
fr: Pile d'appels :

source: SIGFPE signal (floating point exception) intercepted!
fr: Signal SIGFPE (exception en virgule flottante) intercepté !

source: SIGSEGV signal (forbidden memory area access) intercepted!
fr: Signal SIGSEGV (accès à une zone mémoire interdite) intercepté !

source: SIGABRT signal (Abort) intercepted.
fr: Signal SIGABRT (Abandon) intercepté !

source: SIGXCPU signal (CPU time limit reached) intercepted.
fr: Signal SIGXCPU (temps CPU limite atteint) intercepté.

source: Signal %d intercepted!
fr: Signal %d intercepté !

source: MPI error (communicator %s): %s
fr: Erreur MPI (communicateur %s): %s

source: MPI error: %s
fr: Erreur MPI : %s

source: command:
fr: commande :

source: revision %s
fr: révision %s

source: MPI version %d.%d (%s, based on %s)
fr: Version MPI %d.%d (%s, basée sur %s)

source: MPI version %d.%d (%s)
fr: Version MPI %d.%d (%s)

source: MPI version %d.%d
fr: Version MPI %d.%d

source: Total memory used:
fr: Consommation mémoire totale mesurée :

source: Theoretical instrumented dynamic memory:
fr: Mémoire dynamique instrumentée théorique :

source: %s %12.3f %ciB
fr: %s %12.3f %cio

source: local minimum: %12.3f %ciB (rank %d)
fr: minimum local : %12.3f %cio (rang %d)

source: local maximum: %12.3f %ciB (rank %d)
fr: maximum local : %12.3f %cio (rang %d)

source: Calculation time summary:
fr: Bilan des temps de calcul :

source: User CPU time: %12.3f s
fr: Temps CPU utilisateur : %12.3f s

source: System CPU time: %12.3f s
fr: Temps CPU système : %12.3f s

source: CPU time: %12.3f s
fr: Temps CPU : %12.3f s

source: Total CPU time: %12.3f s
fr: Temps CPU cumulé : %12.3f s

source: Elapsed time: %12.3f s
fr: Temps écoulé : %12.3f s

source: CPU / elapsed time %12.3f
fr: Temps CPU / écoulé %12.3f

source: It is impossible to redirect the standard error to file: %s
fr: Il est impossible de rediriger les sorties erreur dans le fichier : %s

source: Code_Saturne: %s:%d: Warning
fr: Code_Saturne : %s:%d : Avertissement

source: Fatal error: bft_printf() called on a message of size %d whereas the print buffer is of size %d.
fr: Erreur fatale: bft_printf() appellé sur message de taille %d alors que le tampon d'impression est de taille %d.

source: The directory %s cannot be created
fr: Le répertoire %s ne peut être créé

source: It is impossible to open the default output file: %s
fr: Il est impossible d'ouvrir le fichier de sortie par défaut : %s

source: Error opening file "%s" from Fortran.
fr: Erreur à l'ouverture du fichier "%s" depuis le Fortran.

source: It is impossible to re-open the default output file: %s
fr: Il est impossible de réouvrir le fichier de sortie par défaut : %s

source: First face with boundary condition definition error (out of %llu) has boundary condition type %d, center (%g, %g, %g)
fr: Première face avec une mauvaise définition de conditions aux limites (sur %llu) a une condition aux limites de type %d, un centre (%g, %g, %g)

source: Faces with B.C. error
fr: Faces avec erreur de C.L.

source: Faces with valid B.C.'s
fr: Faces avec C.L. valides

source: BC type
fr: Type de CL

source: Some boundary condition definitions are incomplete or incorrect. For details, read the end of the calculation log, or visualize the error postprocessing output.
fr: Certaines définitions de conditions aux limites sont incomplètes ou incorrectes : Pour plus de détails, vérifiez la fin du "listing" de calcul, ou visualisez le post traitement dédié aux erreurs.

source: %d first and last elements:
fr: %d premiers et derniers éléments :

source: Component %d [%p], port %s:
fr: Composant %d [%p], port %s:

source: Component %d:
fr: Composant %d:

source: Reading up to %d values of type %s, time_dependency %s (min/max time %f/%f, iteration %d) ...
fr: Lecture d'au plus %d valeurs de type %s, dep_temps %s (temps min/max %f/%f, itération %d) ...

source: [ok] Read %d values (min time %f, iteration %d).
fr: [ok] Lu %d valeurs (temps min %f, itération %d).

source: Writing %d values of type %s, time_dependency %s (time %f, iteration %d) ...
fr: Écriture de %d valeurs de type %s, dep_temps %s (temps %f, itération %d) ...

source: ignored: "%s"
fr: ignoré : "%s"

source: Options set or changed by "control_file": -----------------------------------------
fr: Options positionnées ou modifiées par fichier "control_file" : --------------------------------------------------------------

source: current:
fr: courant :

source: flush logs at time step %12d
fr: vidage des tampons des fichiers journaux au pas de temps %12d

source: Finished reading "control_file".
fr: Lecture de "control_file" terminée.

source: Warning: error opening %s (ignored): -------- "%s"
fr: Attention : erreur à l'ouverture de %s (ignorée): -------- "%s"

source: point-to-point or not synchronized
fr: point à point ou non synchronisé

source: group synchronized
fr: synchronisé par groupe

source: (this instance)
fr: (cette instance)

source: Applications accessible through MPI: ------------------------------------
fr: Applications accessibles via MPI : ----------------------------------

source: %d; type: "%s"%s case name: "%s" lead rank: %d; n_ranks: %d (%s
fr: %d; type : "%s"%s nom de cas : "%s" rang racine : %d ; nb_rangs : %d (%s

source: , time step min.
fr: , pas de temps min.

source: , time step leader
fr: , pas de temps maître

source: , unsteady
fr: , instationnaire

source: , steady
fr: , stationnaire
