Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: %s version %s (built %s)
fr: %s version %s (compilée le %s)

source: (built %s)
fr: (compilé le %s)

source: STAR-CCM+ file format support
fr: Support du format de fichiers STAR-CCM+

source: CGNS %d.%d.%d file format support
fr: Support du format de fichiers CGNS %d.%d.%d

source: CGNS %d.%d file format support
fr: Support du format de fichiers CGNS %d.%d

source: MED %d.%d (HDF5 %d.%d.%d) file format support
fr: Support du format de fichiers MED %d.%d (HDF5 %d.%d.%d)

source: MED %d.%d.%d (HDF5 %d.%d.%d) file format support
fr: Support du format de fichiers MED %d.%d.%d (HDF5 %d.%d.%d)

source: Reading of compressed files ('.gz') with Zlib %s
fr: Lecture de fichiers compressés ('.gz') avec Zlib %s

source: (compiled with Zlib %s)
fr: (compilé avec Zlib %s)

source: .------------------------------. | | | Code_Saturne Preprocessor | | | `------------------------------'
fr: .--------------------------------. | | | Préprocesseur Code_Saturne | | | `--------------------------------'

source: Usage: %s [<options>] <file>
fr: Utilisation : %s [<options>] <fichier>

source: General options:
fr: Options générales :

source: : this help message
fr: : ce message d'aide

source: : same
fr: : idem

source: [file]
fr: [fichier]

source: : redirect terminal output to a file
fr: : redirection des impressions dans un fichier

source: (default file: "%s")
fr: (fichier par défaut : "%s")

source: : do not write preprocessor output
fr: : ne pas écrire de fichier en sortie

source: <file>
fr: <fichier>

source: : output file name
fr: : nom du fichier de sortie

source: : if necessary, correct orientation of
fr: : correction si nécessaire de l'orientation des

source: cells and faces
fr: cellules et faces

source: : print version number
fr: : affichage du numéro de version

source: Mesh selection options:
fr: Options de sélection de maillage :

source: <keyword>
fr: <mot clé>

source: : selection of mesh file format
fr: : sélection du format du fichier de maillage

source: : selection of mesh numbers in file
fr: : sélection de numéros de maillage dans

source: (if the format allows it)
fr: le fichier (si le format le permet)

source: : add groups of cells
fr: : ajoute des groupes de cellules

source: * based on sections: keyword "section"
fr: * selon les sections : mot clé "section"

source: * based on zones: keyword "zone"
fr: * selon les zones : mot clé "zone"

source: (based on format features/conventions)
fr: (selon possibilités/conventions du format)

source: : add groups of faces
fr: : ajoute des groupes de faces

source: Available mesh formats:
fr: Formats de maillage disponibles :

source: extension: keyword:
fr: extension : mot-clé :

source: Postprocessing options:
fr: options de post-traitement :

source: <name>
fr: <nom>

source: : case name (without this option,
fr: : nom du cas (en l'absence de cette option,

source: the default name is: "%s"
fr: le nom du par défaut est : "%s"

source: : select output format of error meshes
fr: : sélection du format des maillages d'erreur.

source: : activate output of volume meshes
fr: : active l'écriture du maillage principal

source: Available output formats:
fr: Formats de maillage de sortie disponibles :

source: keyword:
fr: mot-clé :

source: Environment variables
fr: Variables d'environnement

source: CS_PREPROCESS_MIN_EDGE_LEN : length under which an edge is considered degenerate (default: 1.e-15)
fr: CS_PREPROCESS_MIN_EDGE_LEN : longueur en dessous de laquelle une arête est considérée comme dégénérée (défaut : 1.e-15)

source: CS_PREPROCESS_MEM_LOG : name of memory operations trace file
fr: CS_PREPROCESS_MEM_LOG : nom du fichier de trace mémoire

source: CS_PREPROCESS_IGNORE_IDEAS_COO_SYS : ignore I-deas coordinate systems
fr: CS_PREPROCESS_IGNORE_IDEAS_COO_SYS : ignore les systèmes de coordonnées I-deas

source: Error in command line specification. Option "%s" is set at least twice.
fr: Erreur dans la spécification de la ligne de commande. La même option "%s" est mentionnée au moins 2 fois.

source: Error in command line specification. Option "%s" requires an argument.
fr: Erreur dans la spécification de la ligne de commande. L'option "%s" nécessite un argument.

source: Case configuration ------------------
fr: Configuration du cas --------------------

source: System
fr: Système

source: Processor
fr: Processeur

source: Memory
fr: Mémoire

source: User
fr: Utilisateur

source: Directory
fr: Répertoire

source: Case name
fr: Nom du cas

source: Mesh file
fr: Fichier de maillage

source: The file does not exist.
fr: Le fichier n'existe pas.

source: Read permission on this file is refused.
fr: La permission de lecture sur le fichier est refusée.

source: The filename is too long (system limit).
fr: Le nom du fichier est trop long (limitation système).

source: The file is not a regular file.
fr: Le fichier n'est pas un fichier régulier.

source: Error in command line specification. Keyword "%s" of option "%s" is not recognized.
fr: Erreur dans la spécification de la ligne de commande. Le mot clé "%s" de l'option "%s" n'est pas reconnu.

source: It is impossible to redirect the standard output to file: %s
fr: Il est impossible de rediriger les sorties standard dans le fichier : %s

source: Option "%s" is not recognized.
fr: L'option "%s" n'est pas reconnue.

source: Error in command line specification: Missing input mesh file name.
fr: Erreur dans la spécification de la ligne de commande : Le nom du fichier de maillage est manquant.

source: Mesh file "%s" is not accessible. %s
fr: Le fichier de maillage "%s" n'est pas accessible. %s

source: Theoretical mesh size: %15.3f %cb
fr: Taille maillage théorique : %15.3f %co

source: Theoretical current memory: %15.3f %cb
fr: Mémoire courante théorique : %15.3f %co

source: Theoretical peak memory: %15.3f %cb
fr: Pic mémoire théorique : %15.3f %co

source: Total memory used: %15.3f %cb
fr: Mémoire totale consommée : %15.3f %co

source: Done reading mesh -----------------
fr: Fin lecture maillage --------------------

source: Done reading and concatenating meshes -------------------------------------
fr: Fin lecture et concaténation des maillages ------------------------------------------

source: Time and memory summary -----------------------
fr: Bilan temps et mémoire ----------------------

source: User CPU time (sec)
fr: Temps CPU utilisateur (sec)

source: System CPU time (sec)
fr: Temps CPU système (sec)

source: Total CPU time (sec)
fr: Temps CPU total (sec)

source: Total time (sec)
fr: Temps total (sec)

source: Total CPU time / Total time
fr: Temps CPU total / Temps total

source: Defining families -----------------
fr: Création des familles ---------------------

source: Fluid Domain
fr: Domaine fluide

source: Orientation Error
fr: Erreur orientation

source: End of conversion to descending connectivity --------------------------------------------
fr: Fin de passage en connectivité descendante ------------------------------------------

source: The mesh has face -> cell connectivity errors. We can go no further.
fr: Le comporte des erreurs de connectivité face -> cellules. On ne peut pas aller plus loin.

source: The mesh does not contain volume elements. We can go no further.
fr: Le maillage ne contient pas d'éléments volumiques. On ne peut pas aller plus loin.

source: Memory use summary:
fr: Bilan de l'occupation mémoire :

source: Total memory used: %15.3f %cb
fr: Mémoire totale consommée : %15.3f %co

source: Theoretical instrumented dynamic memory: %15.3f %cb
fr: Mémoire dynamique instrumentée théorique : %15.3f %co

source: .-----------------------. | | | Preprocessor finish | | | `-----------------------'
fr: .--------------------------------. | | | Fin normale du Préprocesseur | | | `--------------------------------'

source: Group
fr: Groupe

source: Family
fr: Famille

source: There are %lu faces of which one same side belongs to at least 2 cells --> bad connectivity.
fr: On compte %lu faces dont un même côté appartient à 2 cellules au moins --> mauvaise connectivité.

source: There is/are %lu isolated face(s)
fr: On compte %lu face(s) isolée(s)

source: Domain coordinate extents:
fr: Coordonnées minimales et maximales du domaine :

source: Main mesh properties --------------------
fr: Données principales du maillage -------------------------------

source: Number of cells: %10d Number of internal faces: %10d
fr: Nombre de cellules : %10d Nombre de faces internes : %10d

source: Number of boundary faces: %10d
fr: Nombre de faces de bord : %10d

source: Number of vertices: %10d
fr: Nombre de sommets : %10d

source: Connectivity Error Faces
fr: Faces erreur connectivite

source: Mesh verification: %d faces modified due to merged vertices.
fr: Vérification de maillage : %d faces modifiées par fusion de sommets.

source: Merging vertices:
fr: Fusion des sommets :

source: Initial number of vertices : %10d
fr: Nombre de sommets initial : %10d

source: Number of vertices after merging : %10d
fr: Nombre de sommets après fusion : %10d

source: Number of modified vertices : %10d
fr: Nombre de sommets modifiés : %10d

source: Number of elements
fr: Nombre d'éléments

source: Element orientation check.
fr: Vérification de l'orientation des éléments.

source: %d elements of type %s had to be re-oriented
fr: %d éléments de type %s ont du être réorientés

source: %d elements of type %s were impossible to re-orient
fr: %d éléments de type %s n'ont pu être réorientés

source: %d elements of type %s are mis-oriented or highly warped
fr: %d éléments de type %s sont mal orientés ou fortement déformés

source: Mesh verification: %d vertices belong to edges of length less than %g and will be merged; (this tolerance may be modified using the CS_PREPROCESS_MIN_EDGE_LEN environment variable).
fr: Contrôle du maillage : On compte %d sommets appartennant à des arêtes de longueur inférieure à %g et qui seront fusionnés ; (cette tolérance peut être modifiée par la variable d'environnement CS_PREPROCESS_MIN_EDGE_LEN).

source: Mesh verification: Removal of %d degenerate faces: Initial number of faces : %10d Number of faces after processing : %10d
fr: Contrôle du maillage : On supprime %d faces dégénérées : Nombre de faces initial : %10d Nombre de faces après traitement : %10d

source: Number of cells
fr: Nombre de cellules

source: Number of internal faces
fr: Nombre de faces internes

source: Number of boundary faces
fr: Nombre de faces de bord

source: Number of isolated faces
fr: Nombre de faces isolées

source: Definition of face and cell families ------------------------------------
fr: Définition des familles de faces et cellules --------------------------------------------

source: Default family
fr: Famille par défaut

source: (no group)
fr: (aucun groupe)

source: Write output for Kernel -----------------------
fr: Écriture des données pour le Noyau ----------------------------------

source: EnSight output of mesh: %s -----------------------
fr: Écriture pour EnSight du maillage : %s -----------------------------------

source: CGNS file output of mesh: %s -------------------------
fr: Écriture sur fichier CGNS du maillage : %s ---------------------------------------

source: MED file output of mesh: %s ------------------------
fr: Écriture sur fichier MED du maillage : %s --------------------------------------

source: Creating mesh for output: %s -------------------------
fr: Création maillage pour sorties : %s --------------------------------

source: Number of faces
fr: Nombre de faces

source: Color
fr: Couleur

source: Number of vertices
fr: Nombre de sommets

source: CGNS: error closing file "%s" %s
fr: CGNS : échec à la fermeture du fichier "%s" %s

source: A mesh named: %s is already defined in CGNS case: %s
fr: On a déjà défini un maillage de nom : %s dans le cas CGNS : %s

source: CGNS: error opening file "%s": %s
fr: CGNS : échec à l'ouverture du fichier "%s" : %s

source: Creating file:
fr: Création du fichier :

source: CGNS: error writing file "%s": Name of mesh to write: "%s" %s
fr: CGNS : échec à l'écriture du fichier "%s": Nom du maillage à écrire : "%s" %s

source: CGNS: error writing file "%s": The returned base number is "%d" and not "1".
fr: CGNS : erreur à l'écriture du fichier "%s" : Le numéro de base renvoyé est "%d" et non "1".

source: MED: error closing file "%s".
fr: MED : échec à la fermeture du fichier "%s".

source: MED: error opening file "%s".
fr: MED : échec à l'ouverture du fichier "%s".

source: A mesh named: %s is already defined in MED case: %s
fr: On a déjà défini un maillage de nom : %s dans le cas MED : %s

source: MED: error writing file "%s". Name of mesh to create: "%s"
fr: MED : erreur a l'écriture du fichier "%s". Nom du maillage à créer : "%s"

source: MED: error writing file "%s". Mesh name: "%s" mesh dimension: "%d", space dimension: "%d"
fr: MED : erreur a l'écriture du fichier "%s". Nom du maillage : "%s" dimension du maillage : "%d" / de l'espace : "%d"

source: EnSight (6 or Gold)
fr: EnSight (6 ou Gold)

source: I-deas universal
fr: I-deas Universel

source: Error querying working directory.
fr: Erreur à la récupération du répertoire d'exécution du cas.

source: Error loading %s: %s.
fr: Erreur au chargement de %s : %s.

source: Error calling dlsym: %s
fr: Erreur à l'appel de dlsym : %s

source: Error in file format specification. Mesh file type "%s" is not recognized. Impossible to determine the format of mesh file "%s".
fr: Erreur dans la spécification du format de fichier. Le type de maillage "%s" n'est pas reconnu. Impossible de déterminer le format du fichier de maillage "%s".

source: Warning ======= The file extension for "%s" does not correspond with the mesh file format defined by keyword "%s". The keyword has priority.
fr: Avertissement ============= L'extension du fichier "%s" ne correspond pas au format défini par le mot clé "%s". Le mot clé est prioritaire.

source: Mesh file "%s" does not have a known extension. A keyword is required to determine the format in this case.
fr: Le fichier de maillage "%s" n'a pas une extension connue. Un mot clé est nécessaire pour déterminer le format dans ce cas.

source: File format "%s" support not available in this installation (file "%s").
fr: Le format de fichier "%s" n'est pas disponible dans cette installation (fichier "%s").

source: Unknown mesh file format.
fr: Format de fichier de maillage non reconnu.

source: Wall-clock time: %f s; CPU time: %f s
fr: Temps écoulé : %f s ; temps CPU : %f s

source: Vertex coordinates set: %s
fr: Jeu de coordonnées des sommets : %s

source: Error %d reading vertex information in STAR-CCM+ file.
fr: Erreur %d à l'interrogation des sommets dans un fichier STAR-CCM+

source: Face-based topology: %s
fr: Topologie basée sur les faces : %s

source: Error %d reading faces information in STAR-CCM+ file.
fr: Erreur %d à l'interrogation des faces dans un fichier STAR-CCM+

source: Error %d reading internal faces in STAR-CCM+ file.
fr: Erreur %d à la lecture des faces intérieures dans un fichier STAR-CCM+

source: Error %d reading face->cell connectivity in STAR-CCM+ file.
fr: Erreur %d à la lecture de la connectivité faces->cellules dans un fichier STAR-CCM+

source: Error %d reading map in STAR-CCM+ file.
fr: Erreur %d à la lecture d'une numérotation dans un fichier STAR-CCM+

source: Reading mesh from file in STAR-CCM+ format ----------------------
fr: Lecture du fichier de maillage au format STAR-CCM+ ------------------------------

source: Mesh file: %s STAR-CCM+ format version: %1d.%1d.%1d Title: %s
fr: Fichier de maillage : %s Version du format STAR-CCM+ : %1d.%1d.%1d Titre : %s

source: Available meshes:
fr: Maillages disponibles :

source: Error %d reading state name in STAR-CCM+ file.
fr: Erreur %d à la lecture d'un état dans un fichier STAR-CCM+.

source: No mesh was specified; the first is read.
fr: On n'a pas précisé de maillage ; on lit le premier

source: Mesh number %d was specified.
fr: On a demandé le maillage numéro %d

source: The specified mesh number (%d) is greater than the number of meshes defined (%d) in file %s.
fr: Le numéro de maillage demandé (%d) est supérieur au nombre de maillages définis (%d) dans le fichier %s.

source: The specified mesh number (%d) is negative.
fr: Le numéro de maillage demandé (%d) est négatif.

source: Error %d reading entity description in STAR-CCM+ file.
fr: Erreur %d à la lecture d'une description dans un fichier STAR-CCM+.

source: Error %d reading processor information in STAR-CCM+ file.
fr: Erreur %d à la lecture de données processeur dans un fichier STAR-CCM+.

source: Error %d reading vertices and topology information in STAR-CCM+ file.
fr: Erreur %d à la lecture d'informations sur les sommets et la topologie dans un fichier STAR-CCM+ file.

source: The file contains multiple bases:
fr: Le fichier contient plusieurs bases :

source: CGNS error: %s
fr: erreur CGNS : %s

source: No base was requested; the first one is used
fr: On n'a pas précisé de base ; on lit la première

source: Base number %d was requested
fr: On a demandé la base numéro %d

source: no CGNS base in file.
fr: aucune base CGNS dans le fichier.

source: The mesh number requested (%d) is higher than the number of bases defined (%d) in file %s.
fr: Le numéro de maillage demandé (%d) est supérieur au nombre de bases définies (%d) dans le fichier %s.

source: CGNS: error closing file "%s": %s
fr: CGNS : échec à la fermeture du fichier "%s" : %s

source: cartesian
fr: cartésiennes

source: cylindrical
fr: cylindriques

source: spherical
fr: sphériques

source: %lu (%lu x %lu) vertices; %lu (%lu x %lu) cells
fr: %lu (%lu x %lu) sommets ; %lu (%lu x %lu) cellules

source: %lu (%lu x %lu x %lu) vertices; %lu (%lu x %lu x %lu) cells
fr: %lu (%lu x %lu x %lu) sommets ; %lu (%lu x %lu x %lu) cellules

source: %lu vertices; %lu cells
fr: %lu sommets ; %lu cellules

source: (%s coordinates, "%s" precision, unit "%s")
fr: (coordonnées %s, précision "%s", unité "%s")

source: %d time-varying coordinates (the first are used)
fr: %d coordonnées temporelles (on prend les premières)

source: Section %2d: "%s"; (indices %lu to %lu, type "%s")
fr: Section %2d : "%s" ; (indices %lu à %lu, type "%s")

source: The CGNS mesh read contains multizone ("one to one") vertex equivalences which are not automatically handled by the Preprocessor. -> Use an appropriate joining option
fr: Le maillage CGNS lu comporte des équivalences de sommets multizones ("one to one") qui ne sont pas prises en compte automatiquement par le Préprocesseur. -> Utilisez un recollement conforme approprié

source: The CGNS mesh read contains non-conforming ("abutting") connectivity information which is not automatically handled by the Preprocessor. -> Use an appropriate joining option
fr: Le maillage CGNS lu comporte des informations de voisinage non conforme ("abutting") qui ne sont pas prises en compte automatiquement par le Préprocesseur. -> Utilisez un recollement conforme approprié

source: The CGNS mesh read contains ("overset") connectivity information which is not handled by the Preprocessor.
fr: Le maillage CGNS lu comporte des informations de voisinage multizone par recouvrement ( "overset") qui ne sont pas pris en compte par le Préprocesseur.

source: CGNS boundary condition information:
fr: Conditions aux limites CGNS indiquées :

source: BC %2d: "%s" ("%s")
fr: CL %2d : "%s" ("%s")

source: BC %2d: "%s" ("%s" on "%s")
fr: CL %2d : "%s" ("%s" sur "%s")

source: Cylindrical or spherical coordinates with unknown or undefined angle unit (-> radians are considered)
fr: Coordonnées cylindriques ou sphériques avec unité d'angle non définie ou inconnue (-> on suppose des radians)

source: Reading mesh from file in CGNS format ----------------------
fr: Lecture du fichier de maillage au format CGNS ------------------------------

source: Mesh file: %s
fr: Fichier de maillage : %s

source: CGNS version : %3.1f
fr: Version CGNS : %3.1f

source: Title :
fr: Titre :

source: Base name : %s
fr: Nom de la base : %s

source: Physical dimension : %d
fr: Dimension physique : %d

source: Cell dimension : %d
fr: Dimension cellule : %d

source: Number of zones : %d
fr: Nombre de zones : %d

source: Mesh entities are of dimension: %d
fr: Les entités de maillage sont de dimension : %d

source: EnSight: file "%s" seems to be of Fortran binary type but its header is of the wrong size or it is of an unknown Fortran binary variant.
fr: EnSight : fichier "%s" apparamment de type binaire Fortran mais entête mal dimensionnée ou de variante binaire Fortran inconnue.

source: EnSight: field "%s" encountered where "coordinates" was expected.
fr: EnSight : rubriqe "%s" alors que l'on attendait "coordinates".

source: %10d nodes
fr: %10d noeuds

source: EnSight: no node defined in file "%s".
fr: EnSight : Aucun noeud défini dans le fichier "%s".

source: EnSight: error reading file "%s". The current "part" contains ghost cells, not currently handled.
fr: EnSight : erreur à la lecture du fichier "%s". La "part" en cours contient des cellules fantômes, non traitées pour l'instant.

source: EnSight: error reading file "%s". The current "part" contains a section of type: "%s" not currently handled.
fr: EnSight : erreur à la lecture du fichier "%s". La "part" en cours contient une section de type : "%s" non gérée pour l'instant.

source: %10d %-10s elements
fr: %10d éléments %-10s

source: EnSight: error merging node groups. At least one of the groups has no "id", and they should not be merged (internal logic problem).
fr: EnSight : erreur à la fusion de groupes de noeuds. Au moins un des groupes n'a pas d'"id", et on ne devrait pas les fusionner (pb. logique interne).

source: EnSight: positionning (seek) error in file "%s".
fr: EnSight : Problème de positionnement dans le fichier "%s".

source: EnSight: "node id" field missing or badly placed.
fr: EnSight : rubriqe "node id" manquante ou mal placée).

source: EnSight: "element id" field missing or badly placed
fr: EnSight : rubriqe "element id" manquante ou mal placée.

source: EnSight: "%s" field encountered where "extents" or "part" was expected.
fr: EnSight : rubriqe "%s" alors que l'on attendait "extents" ou "part".

source: File "%s" defines no "part" (i.e. mesh).
fr: Le fichier "%s" ne définit aucun "part" (i.e. maillage).

source: EnSight: file "%s" seems to be of C binary type but the number of the first "part" is < 0 ou > 1000 and provokes the failure of the automatic "big-endian/little-endian" detection.
fr: EnSight : fichier "%s" apparamment de type binaire C mais le numéro de la première "part" est < 0 ou > 1000 et fausse la détection automatique "big-endian/little-endian".

source: Remark: no vertex ids given --> impossible to merge EnSight "parts", so the following "parts" are ignored.
fr: Remarque : pas d'id de sommets précisés --> impossibilité de fusionner les "parts" EnSight, donc "parts" suivantes ignorées.

source: part %2d (ignored):
fr: part %2d (ignoré) :

source: EnSight: file "%s" does not contain a "part" with the required number (%d).
fr: EnSight : le fichier "%s" ne contient pas de "part" du numéro demandé (%d).

source: EnSight: file "%s" does not contain any "part".
fr: EnSight : le fichier "%s" ne contient pas de "part".

source: EnSight: "%s" field encountered where "part" was expected.
fr: EnSight : rubriqe "%s" alors que l'on attendait "part".

source: Reading mesh from file in EnSight format ----------------------
fr: Lecture du fichier de maillage au format EnSight ------------------------------

source: "case" file: %s
fr: Fichier "case" : %s

source: File "%s" does not seem to be a valid EnSight 6 or Gold case file.
fr: Le fichier "%s" ne semble pas être un fichier case EnSight 6 ou Gold valide

source: The "%s" case file does not seem to indicate a geometry file
fr: Le fichier case "%s" ne semble pas indiquer de fichier géométrique
