Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: The "%s" case file seems to indicate the series of geometric files named: "%s". A single file must be chosen.
fr: Le fichier case "%s" semble indiquer la série de fichier géométriques de nom : "%s". On doit choisir un fichier unique.

source: "geo" file: %s
fr: Fichier "geo" : %s

source: Error reading line %d of file "%s"; An end of section (ENDOFSECTION) was expected.
fr: Erreur à la lecture de la ligne %d du fichier "%s" ; On s'attendait à une fin de section (ENDOFSECTION).

source: Format error for file "%s": This file does not seem to be in GAMBIT neutral format (line 2 does not start with "** GAMBIT NEUTRAL FILE").
fr: Erreur de format du fichier "%s" : Ce fichier ne semble pas être au format GAMBIT neutral (la ligne 2 ne commence pas par "** GAMBIT NEUTRAL FILE").

source: Title : %.80s
fr: Titre : %.80s

source: Created with : %s %s
fr: Créé avec : %s %s

source: Error reading line %d of file "%s".
fr: Erreur à la lecture de la ligne %d du fichier "%s".

source: Initial data: %10d points %10d elements %10d groups %10d boundary conditions spatial dimension: %d velocity components: %d
fr: Données initiales : %10d points %10d éléments %10d groupes %10d conditions aux limites dimension spatiale : %d composants vitesse : %d

source: Error reading line %d of file "%s" while decoding point %d (of %d).
fr: Erreur à la lecture de la ligne %d du fichier "%s" lors du décodage du point %d (sur %d).

source: The mesh is 2d.
fr: Le maillage est surfacique plan.

source: Error reading line %d of file "%s" while decoding element %ld (of %ld).
fr: Erreur à la lecture de la ligne %d du fichier "%s" lors du décodage de l'élément %ld (sur %ld).

source: Error reading a GAMBIT mesh file: at line %d of file "%s". Type identifier <%d> for element <%d> is not recognized.
fr: Erreur à la lecture du fichier de maillage GAMBIT : à la ligne %d du fichier "%s". L'identificateur <%d> du type de l'élément <%d> n'est pas reconnu.

source: Error reading line %d of file "%s" while defining a group.
fr: Erreur à la lecture de la ligne %d du fichier "%s" lors de la définition d'un groupe.

source: Group %10d: "%s" type: %s elements: %d indicators: %d
fr: Groupe %10d : "%s" type : %s éléments : %d indicateurs : %d

source: Error reading line %d of file "%s" while defining a boundary condition.
fr: Erreur à la lecture de la ligne %d du fichier "%s" lors de la définition d'une condition aux limites.

source: Boundary condition: "%s" type: %s entities: %d values: %d
fr: Condition aux limites : "%s" type : %s entités : %d valeurs : %d

source: Reading mesh from file in GAMBIT neutral format ----------------------
fr: Lecture du fichier de maillage au format GAMBIT neutral ------------------------------

source: Error reading a GAMBIT mesh file: at line %d of file "%s". The number of groups to read is larger than that defined by the header (%d).n
fr: Erreur à la lecture du fichier de maillage GAMBIT : à la ligne %d du fichier "%s". Le nombre de groupes à lire est supérieur à celui défini après l'entête (%d).n

source: Error reading a GAMBIT mesh file: at line %d of file "%s". The number of boundary conditions to read is larger than that defined by the header (%d).n
fr: Erreur à la lecture du fichier de maillage GAMBIT : à la ligne %d du fichier "%s". Le nombre de conditions aux limites à lire est supérieur à celui défini après l'entête (%d).n

source: File "%s" ,contains a "FACE CONNECTIVITY" section indicating non-conforming faces which are not automatically handled by the Preprocessor. -> Use an appropriate joining option.
fr: Le fichier "%s" ,contient une section "FACE CONNECTIVITY" indiquant des faces non conformes qui ne sont pas prises en compte automatiquement par le Préprocesseur. -> Utilisez un recollement conforme approprié

source: Line %d of file "%s" ,section: "%s" is unknown.
fr: Ligne %d du fichier "%s" ,la rubrique : "%s" est inconnue.

source: Line %d of file "%s", processing is finished but the end of the file has not been reached.
fr: Ligne %d du fichier "%s", le traitement est terminé mais la fin du fichier n'a pas été atteinte.

source: Error reading file "%s": Section "NODAL COORDINATES" was not found.
fr: Erreur à la lecture du fichier "%s" : La section "NODAL COORDINATES" n'a pas été trouvée.

source: Error reading file "%s": Section "ELEMENTS/CELLS" was not found.
fr: Erreur à la lecture du fichier "%s" : La section "ELEMENTS/CELLS" n'a pas été trouvée.

source: Building mesh structure:
fr: Construction de la structure de maillage :

source: The Gmsh version specification of file "%s" is invalid or unreadable.)
fr: La spécification de version du format Gmsh du fichier "%s" est invalide ou illisible.)

source: The Gmsh type specification of file "%s" is neither 0 (text file) nor 1 (binary file). This case is currently not handled.
fr: La spécification de type du format Gmsh du fichier "%s" est différente de 0 (fichier texte) ou 1 (binaire). On ne sait pas actuellement traiter ce cas.

source: Gmsh format version: %2.1f Size given for real numbers: %d
fr: Version de format Gmsh : %2.1f Taille indiquée pour les réels : %d

source: The Gmsh format version specification end for file "%s" is not present at the expected place.)
fr: La fin de spécification de version du format Gmsh du fichier "%s" n'est pas présente à l'emplacement attendu.)

source: Error decoding line %ld of file "%s" : The description of point <%ld> was expected in the form "label x y z".
fr: Erreur au décodage de la ligne %ld du fichier "%s" : On attendait la description du point <%ld> sous la forme "label x y z".

source: The end of the points list specification of file "%s" is not present at the expected place.)
fr: La fin de spécification de la liste des noeuds du fichier "%s" n'est pas présente à l'emplacement attendu.)

source: Error reading a Gmsh mesh file: at line %ld of file "%s". Type identifier <%d> for element <%ld> is not recognized.
fr: Erreur à la lecture du fichier de maillage Gmsh : à la ligne %ld du fichier "%s". L'identificateur <%d> du type de l'élément <%ld> n'est pas reconnu.

source: Error decoding line %ld (corresponding to element <%ld>) of file "%s".
fr: Erreur au décodage de la ligne %ld (correspondant à l'élément <%ld>) du fichier "%s".

source: Error reading a Gmsh mesh file: Type identifier <%d> is not recognized.
fr: Erreur à la lecture du fichier de maillage Gmsh : L'identificateur de type d'élément <%d> n'est pas reconnu.

source: %ld elements of type "point" ignored
fr: %ld éléments de type "point" ont été ignorés

source: %ld elements of type "edge" ignored
fr: %ld éléments de type "arête" ont été ignorés

source: The end of the elements list specification of file "%s" is not present at the expected place.)
fr: La fin de spécification de la liste des éléments du fichier "%s" n'est pas présente à l'emplacement attendu.)

source: Reading mesh from file in Gmsh format ----------------------
fr: Lecture du fichier de maillage au format Gmsh ------------------------------

source: Error reading line %ld of file "%s".
fr: Erreur à la lecture de la ligne %ld du fichier "%s".

source: Error reading a Gmsh mesh file: at line %ld of file "%s". The points definition was not found.
fr: Erreur à la lecture du fichier de maillage Gmsh : à la ligne %ld du fichier "%s". La définition des points n'a pas été trouvée.

source: Error reading a Gmsh mesh file: at line %ld of file "%s". The elements definition was not found.
fr: Erreur à la lecture du fichier de maillage Gmsh : à la ligne %ld du fichier "%s". La définition des éléments n'a pas été trouvée.

source: %d cylindrical system(s) and %d spherical system(s) not converted;
fr: %d systèmes(s) cylindriques(s) et %d systèmes(s) sphériques(s) non convertis ;

source: probable problems depending on I-deas construction and export
fr: problèmes probables selon construction et export I-deas

source: Ignored coordinate systems:
fr: Systèmes de coordonnées ignorés :

source: %d non-identity transformation(s) ignored:
fr: %d transformation(s) non-identité ignorée(s) :

source: Error reading an I-deas universal file: at line %d of file "%s". Type identifier <%d> of element <%d> not recognized.
fr: Erreur à la lecture du fichier de maillage I-deas : à la ligne %d du fichier "%s". L'identificateur <%d> du type de l'élément <%d> n'est pas reconnu.

source: Error reading an I-deas universal file: at line %d of file "%s". Type identifier <%d> of element <%d> recognized but not handled.
fr: Erreur à la lecture du fichier de maillage I-deas : à la ligne %d du fichier "%s". L'identificateur <%d> du type de l'élément <%d> est reconnu mais non géré.

source: Reading mesh from file in I-deas universal format ----------------------
fr: Lecture du fichier de maillage au format universel I-deas ------------------------------

source: Error reading an I-deas universal file: at line %d of file "%s". Node and element datasets must be read before the groups dataset.
fr: Erreur à la lecture du fichier de maillage I-deas : à la ligne %d du fichier "%s". Les datasets sur les noeuds et les elements doivent être lus avant le dataset sur les groupes.

source: Error reading an I-deas universal file: at line %d of file "%s". Dataset "%d" containing the nodes definition has not been found.
fr: Erreur à la lecture du fichier de maillage I-deas : à la ligne %d du fichier "%s". Le dataset "%d" contenant la définition des noeuds n'a pas été trouvé.

source: Error reading an I-deas universal file: at line %d of file "%s". Dataset "%d" containing the elements definition has not been found.
fr: Erreur à la lecture du fichier de maillage I-deas : à la ligne %d du fichier "%s". Le dataset "%d" contenant la définition des éléments n'a pas été trouvé.

source: MED: error checking file version "%s".
fr: MED : échec à la vérification de la version du fichier "%s".

source: MED: error reading file "%s". Number of vertices of entity read: "%d".
fr: MED : erreur à la lecture du fichier "%s". Nombre de noeuds de l'entité lus : "%d".

source: MED: error reading file "%s". Error reading coordinates.
fr: MED : erreur à la lecture du fichier "%s". Erreur à la lecture des coordonnées.

source: MED: error reading file "%s". Number of elements of entity read: "%d".
fr: MED : erreur à la lecture du fichier "%s". Nombre d'éléments de l'entité lus : "%d".

source: The MED mesh contains %d elements of type %s which are ignored by the Preprocessor.
fr: Le maillage MED comporte %d éléments de type %s qui sont ignorés par le Préprocesseur.

source: MED: error reading file "%s". Error reading equivalence information.
fr: MED : erreur à la lecture du fichier "%s". Erreur à la lecture d'une équivalence.

source: MED: error reading file "%s". Error reading connectivity.
fr: MED : erreur à la lecture du fichier "%s". Erreur à la lecture de la connectivité.

source: MED: error reading file "%s". (polygons information).
fr: MED : erreur à la lecture du fichier "%s". (information sur les polygones).

source: MED: error reading file "%s". (polygons connectivity).
fr: MED : erreur à la lecture du fichier "%s". (connectivité des polygones).

source: MED: error reading file "%s". (polyhedra information).
fr: MED : erreur à la lecture du fichier "%s". (information sur les polyèdres).

source: MED: error reading file "%s". (polyhedra connectivity).
fr: MED : erreur à la lecture du fichier "%s". (connectivité des polyèdres).

source: MED: inconsistency in polyhedra connectivity; number of polyhedra: %d the cells->faces end index (%d) should be equal to the size of the faces->vertices index array (%d)
fr: MED : incohérence dans la connectivité des polyèdres ; nombre de polyèdres : %d indice de fin cellules->faces (%d) devrait être égal à la taille du tableau d'indices faces->sommets (%d)

source: While reading file "%s", %d repeated references to the same vertices and %d degenerate faces were encountered in the definition of %d polyhedra.
fr: Lors de la lecture du fichier "%s", on a rencontré %d références répétées à des mêmes sommets et %d faces dégénérées lors de la définition de %d polyèdres.

source: MED: erreur reading file "%s". (families).
fr: MED : erreur à la lecture du fichier "%s". (familles).

source: MED: error reading file "%s". Number of families read: "%d"
fr: MED : erreur à la lecture du fichier "%s". Nombre de familles lues : "%d"

source: MED: error reading file "%s". Number of attributes read: "%d"
fr: MED : erreur à la lecture du fichier "%s". Nombre d'attributs lus : "%d"

source: MED: error reading file "%s". Number of groups read: "%d"
fr: MED : erreur à la lecture du fichier "%s". Nombre de groupes lus : "%d"

source: Family %2d is described by no attribute or group.
fr: La famille %2d n'est décrite par aucun attribut ou groupe

source: Reading mesh from file in MED (EDF/CEA) format ----------------------
fr: Lecture du fichier de maillage au format MED (EDF/CEA) ------------------------------

source: MED: error reading file "%s".
fr: MED : erreur à la lecture du fichier "%s".

source: The file contains multiple meshes:
fr: Le fichier contient plusieurs maillages :

source: Mesh %2d: %s
fr: Maillage %2d : %s

source: No mesh in file.
fr: Aucun maillage dans le fichier.

source: MED: error reading file "%s". Name of mesh read : "%s" Dimension read : "%d"
fr: MED : erreur à la lecture du fichier "%s". Nom du maillage lu : "%s" Dimension lue : "%d"

source: Mesh name: %s
fr: Nom du maillage : %s

source: Error reading NOPO file "%s".size of record "%s" is %d words but %d were expected.
fr: Erreur à la lecture du fichier NOPO "%s".la dimension de l'enregistrement "%s" est de %d mots alors que l'on en attendait %d.

source: This function has been compiled with a "float" type of size other than 4. (Porting error making conversion of single-precision NOPO coordinates to standard Code_Saturne Preprocessor coordinates impossible).
fr: Ce sous-programme a été compilé avec un type "float" de taille différente de 4. (Erreur de portage bloquante pour la conversion des coordonnées simple précision NOPO en coordonnées standard Préprocesseur Code_Saturne).

source: This function has been compiled with a "double" type of size other than 8. (Porting error making conversion of double-precision NOPO coordinates to standard Code_Saturne Preprocessor coordinates impossible).
fr: Ce sous-programme a été compilé avec un type "double" de taille différente de 8. (Erreur de portage bloquante pour la conversion des coordonnées double précision NOPO en coordonnées standard Préprocesseur Code_Saturne).

source: Reading mesh from file in NOPO (Simail) format ----------------------
fr: Lecture du fichier de maillage au format NOPO (Simail) ------------------------------

source: Format error for file "%s" : This file does not seem to be in NOPO format (the header length is not 56 (32-bit) or 208 (64-bit)).
fr: Erreur de format du fichier "%s" : Ce fichier ne semble pas être au format NOPO (la longueur de l'entête est différente de 56 (32-bit) ou 208 (64-bit)).

source: Format error for file "%s" : The reserved descriptor values are not those expected; this file is probably not a NOPO/Simail file.
fr: Erreur de format du fichier "%s" : Les valeurs réservées du descripteur ne correspondent pas aux valeurs attendues ; ce fichier n'est probablement pas un fichier NOPO/Simail.

source: Title : %.80s
fr: Titre : %.80s

source: Creator : %24.24s
fr: Créateur : %24.24s

source: Format error for file "%s" : String 'NOPO' does not appear in header; this file is probably not a NOPO/Simail file.
fr: Erreur de format du fichier "%s" : Les caractères 'NOPO' n'apparaissent pas dans l'entête ; ce fichier n'est probablement pas un fichier NOPO/Simail

source: Initial data: %10d points %10d nodes %10d point elements %10d segments %10d triangles %10d quadrangles
fr: Données initiales : %10d points %10d noeuds %10d éléments points %10d segments %10d triangles %10d quadrangles

source: %10d tetrahedra %10d pentahedra %10d hexahedra
fr: %10d tétraèdres %10d pentaèdres %10d hexaèdres

source: Error reading NOPO file: "%s"; The coordinate system is cylindrical or spherical, and this case is not currently handled
fr: Erreur à la lecture du fichier NOPO : "%s" ; Le système de coordonnés est cylindrique ou sphérique, ce qui n'est pas prévu dans la version actuelle

source: Elements of the mesh to post-process have not been sorted by type.
fr: Les éléments du maillage à post-traiter n'ont pas été triés selon leurs types.

source: CGNS: no mesh named "%s". is associated to file: "%s"
fr: CGNS : aucun maillage nommé "%s". n'est associé au fichier : "%s"

source: CGNS: error re-opening file "%s": %s
fr: CGNS : échec à la réouverture du fichier "%s" : %s

source: CGNS: error writing coordinates Name of mesh to write: "%s" %s
fr: CGNS : échec à l'écriture des coordonnées Nom du maillage à écrire : "%s" %s

source: CGNS: in mesh: "%s", %d polyhedral cells are ignored.
fr: CGNS : dans le maillage : "%s", %d cellules polyèdriques sont ignorées.

source: MED: no mesh named "%s". is associated with file: "%s"
fr: MED : aucun maillage nommé "%s". n'est associé au fichier : "%s"

source: MED: error writing file "%s". Name of family to write: "%s" Number of family to write: "%d"
fr: MED : erreur a l'écriture du fichier "%s". Nom de la famille à écrire : "%s" Numéro de la famille à écrire : "%d"

source: MED: error writing file "%s". Error writing coordinates.
fr: MED : erreur à l'écriture du fichier "%s". Erreur à l'écriture des coordonnées.

source: MED: error writing file "%s". The element geometric type has no MED equivalent. Element geometric type: "%d"
fr: MED : erreur à l'écriture du fichier "%s". Le type géométrique de l'élément n'a pas d'équivalent pour MED. Type géometrique de l'élément : "%d"

source: MED: error writing file "%s". Error writing connectivity.
fr: MED : erreur a l'écriture du fichier "%s". Erreur à l'écriture de la connectivité.

source: MED: error writing file "%s". Error writing polygons connectivity.
fr: MED : erreur a l'écriture du fichier "%s". Erreur à l'écriture de la connectivité des polygones.

source: MED: error writing file "%s". Error writing polyhedra connectivity.
fr: MED : erreur a l'écriture du fichier "%s". Erreur à l'écriture de la connectivité des polyèdres.

source: MED: error writing file "%s". Error writing families.
fr: MED : erreur a l'écriture du fichier "%s". Erreur à l'écriture des familles.

source: Call stack
fr: Pile d'appels

source: End of stack
fr: Fin de la pile

source: Wrote: "%s"%s; Type: "%s"%s; Size: %lu
fr: Écrit : "%s"%s; Type : "%s"%s; Taille : %lu

source: Wrote: "%s"
fr: Écrit : "%s"

source: Opening file: %s
fr: Ouverture du fichier : %s

source: Closing file: %s
fr: Fermeture du fichier : %s

source: SIGHUP signal (hang-up) intercepted. --> computation interrupted.
fr: Signal SIGHUP (déconnexion) intercepté. --> calcul interrompu.

source: SIGINT signal (Control+C or equivalent) received. --> computation interrupted by user.
fr: Signal SIGINT (Control+C ou équivalent) reçu. --> calcul interrompu par l'utilisateur.

source: SIGTERM signal (termination) received. --> computation interrupted by environment.
fr: Signal SIGTERM (terminaison) reçu. --> calcul interrompu par l'environnement.

source: SIGFPE signal (floating-point exception) intercepted !
fr: Signal SIGFPE (exception en virgule flottante) intercepté !

source: SIGSEGV signal (access to forbidden memory area) intercepted !
fr: Signal SIGSEGV (accès à une zone mémoire interdite) intercepté !

source: SIGXCPU signal (CPU time limit exceeded) intercepted.
fr: Signal SIGXCPU (temps CPU limite atteint) intercepté.

source: Signal %d intercepted !
fr: Signal %d intercepté !

source: Abnormal end
fr: Fin anormale

source: Warning =======
fr: Avertissement =============

source: Error in preprocessor execution ===============================
fr: Erreur a l'exécution du préprocesseur =====================================

source: System error: %s
fr: Erreur système : %s

source: %s:%d: Fatal error.
fr: %s:%d: Erreur fatale.

source: Error reading binary file "%s": %s
fr: Erreur à la lecture du fichier binaire "%s" : %s

source: Error: reading from closed file "%s"
fr: Erreur : lecture à partir d'un fichier fermé "%s"

source: Error writing binary file "%s": %s
fr: Erreur à l'écriture du fichier binaire "%s" : %s

source: Error reading Fortran binary file "%s": %s
fr: Erreur à la lecture du fichier binaire Fortran "%s" : %s

source: Error writing Fortran binary file "%s": %s
fr: Erreur à l'écriture du fichier binaire Fortran "%s" : %s

source: Error writing to text file "%s": %s
fr: Erreur à l'écriture du fichier texte "%s" : %s

source: Error writing to closed file "%s"
fr: Erreur à l'écriture dans le fichier fermé "%s"

source: Error reading line %d of text file "%s": %s
fr: Erreur à la lecture de la ligne %d du fichier texte "%s" : %s

source: Error reading text file "%s": %s
fr: Erreur à la lecture du fichier texte "%s" : %s

source: Error opening file "%s": %s
fr: Erreur à l'ouverture du fichier "%s" : %s

source: Error closing file "%s": %s
fr: Erreur à la fermeture du fichier "%s" : %s

source: Error flushing file "%s": %s
fr: Erreur au vidage du tampon d'écriture du fichier "%s" : %s

source: Error obtaining position in file "%s": %s
fr: Erreur à l'obtention de la position dans le fichier "%s" : %s

source: Error rewinding file "%s": %s
fr: Erreur au rembobinage du fichier "%s" : %s

source: Error setting position in file "%s": %s
fr: Erreur de positionnement dans le fichier "%s" : %s

source: sizeof(off_t) > sizeof(long) but fseeko() not available
fr: sizeof(off_t) > sizeof(long) mais fseeko() non disponible

source: Error reading line %d of file "%s": %s
fr: Erreur à la lecture de la ligne %d du fichier "%s" : %s

source: Error reading file "%s": %s
fr: Erreur à la lecture du fichier "%s" : %s

source: Failure to create directory "%s": %s
fr: Éche à la création du répertoire "%s": %s

source: A similarly named file exists and is not a directory.
fr: Un fichier de même nom existe et n'est pas un répertoire.

source: unknown
fr: inconnu

source: Failure to allocate "%s" (%lu bytes)
fr: Impossible d'allouer "%s" (%lu octets)

source: Failure to reallocate "%s" (%lu bytes)
fr: Impossible de réallouer "%s" (%lu octets)

source: Matrix.vector product (symm coeffs) ---------------------
fr: Produit matrice.vecteur (coeffs sym) -----------------------

source: Matrix.vector product ---------------------
fr: Produit matrice.vecteur -----------------------

source: (calls: %d; test sum: %12.5f)
fr: (appels : %d; somme test : %12.5f)

source: Local matrix.vector product ---------------------------
fr: Produit matrice.vecteur local -----------------------------

source: (Matrix-diagonal).vector product (%s) --------------------------------
fr: Produit (matrice-diagonale).vecteur (%s) -----------------------------------

source: Matrix.vector product, extradiagonal part, variant 0 ---------------------
fr: Produit matrice.vecteur, partie extradiagonale, variante 0 -----------------------

source: Matrix.vector product, extradiagonal part, variant 1 ---------------------
fr: Produit matrice.vecteur, partie extradiagonale, variante 1 -----------------------

source: Matrix.vector product, face values only ---------------------
fr: Produit matrice.vecteur, valeurs aux faces uniquement -----------------------

source: Benchmark mode activated ========================
fr: Activation du mode Benchmark ============================

source: General tuning for matrices =====================================
fr: Optimisation générique des matrices ===================================

source: Tuning for symmetric matrices =============================
fr: Optimisation des matrices symétriques =====================================
