Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: WARNING: ABORT WHILE READING THE RESTART FILE ******** cooling tower MODULE CURRENT AND PREVIOUS DATA ARE DIFFERENT The number of nodes on each vertical mesh for the water mesh has been modified. PREVIOUS: %d nodes CURRENT: %d nodes The calculation will not be run. Verify that the restart file corresponds to a restart file for the cooling tower module. Verify usctdz.
fr: ATTENTION : LECTURE DU FICHIER SUITE ********* MODULE AEROREFRIGERANTS DONNEES AMONT ET ACTUELLES DIFFERENTES Le nombre de noeuds sur les maillages verticaux pour le maillage eau a été modifié. AMONT : %d noeuds ACTUEL : %d noeuds Le calcul ne peut être exécuté. Vérifier que le fichier de reprise de calcul utilisé correspond bien au cas traité. Vérifier usctdz.

source: Local halo definition
fr: Définition du halo local

source: Updating the vertex -> faces connectivity
fr: Mise à jour de la connectivité faces -> cellules

source: Distant halo definition
fr: Création du halo distant

source: Creating halos
fr: Création des halos

source: Defining halos
fr: Définition des halos

source: edges
fr: arêtes

source: simple polygons
fr: polygones simples

source: tetrahedra
fr: tétraèdres

source: pyramids
fr: pyramides

source: prisms
fr: prismes

source: hexahedra
fr: hexaèdres

source: simple polyhedra
fr: polyèdres simples

source: edge
fr: arête

source: simple polygon
fr: polygone simple

source: tetrahedron
fr: tétraèdre

source: pyramid
fr: pyramide

source: prism
fr: prisme

source: hexahedron
fr: hexaèdre

source: simple polyhedron
fr: polyèdre simple

source: Morton (in bounding box)
fr: Morton (dans boîte englobante)

source: Morton (in bounding cube)
fr: Morton (dans cube englobant)

source: Hilbert (in bounding box)
fr: Hilbert (dans boîte englobante)

source: Hilbert (in bounding cube)
fr: Hilbert (dans cube englobant)

source: null
fr: nulle

source: mixed
fr: mixte

source: Operator needs a right operand.
fr: L'opérateur nécessite une opérande à droite

source: Operator needs a left operand.
fr: L'opérateur nécessite une opérande à gauche

source: Operator should not have a left operand.
fr: L'opérateur ne devrait pas avoir une opérande à gauche

source: Missing or wrong argument separator.
fr: Séparateur d'arguments manquant ou incorrect

source: Missing argument after separator.
fr: Argument manquant après un séparateur

source: This geometric function is not implemented.
fr: Cette fonction géométrique n'est pas implantée.

source: Wrong number of floating-point arguments.
fr: Nombre incorrect d'arguments de type virgule flotante

source: Expected syntax: epsilon = <value>
fr: Syntax attendue : epsilon = <valeur>

source: Unexpected argument(s).
fr: Argument(s) inattendu(s)

source: Missing closing ].
fr: ] fermant manquant.

source: Function arguments used with an unknown operator.
fr: Arguments de fonction utilisés avec un opérateur inconnu.

source: Operator does not accept function arguments.
fr: L'opérateur n'accepte pas les arguments de fonction

source: Function requires 0 arguments.
fr: La fonction prend 0 arguments

source: range[] argument error
fr: Erreur d'arguments de range[]

source: Inconsistant interval specification.
fr: Spécification d'intervalle incohérente

source: Operator needs a floating point operand
fr: L'opérateur nécessite une opérande de type virgule-flottante

source: Expected operator instead of operand.
fr: Opérateur attendu au lieu d'une opérande.

source: Parenthesis mismatch
fr: Les Parenthèses ne correspondent pas

source: Syntax error, probably due to misplaced operands.
fr: Erreur de syntaxe, probablement due à des opérandes mal placés

source: Postfix evaluation error.
fr: Erreur d'évaluation du postfix.

source: Postfix error: range arguments of different or incorrect type.
fr: Erreur postfix: arguments de range[] de types différent ou incorrects.

source: Operator %s not currently implemented.
fr: Opérateur %s non encore implémenté.

source: Error initializing pipeline from "%s":
fr: Erreur à l'initialisation du pipeline depuis "%s" :

source: Empty CCMIO filename.
fr: Nom de fichier CCMIO vide.

source: CCMIOOpenFile() failed to open file "%s" CCMIO error %d.
fr: CCMIOOpenFile() n'est pas parvenu à ouvrir le fichier "%s" Ereur CCMIO %d.

source: CCMIO error %d closing file.
fr: Erreur CCMIO %d à la fermeture d'un fichier.

source: Empty CGNS filename.
fr: Nom de fichier CGNS vide.

source: The given time step value should be >= 0, and not %d
fr: la valeur du pas de temps fournie devrait être >= 0, et non %d

source: The given time step value should be >= %d, and not %d
fr: la valeur du pas de temps fournie devrait être >= %d, et non %d

source: Data of dimension %d not handled
fr: Données de dimension %d non gérées

source: Error closing EnSight output file (text mode): %s
fr: Erreur à la fermeture du fichier de sortie EnSight (mode texte) %s

source: The given time step value should be >= 0, and not %d.
fr: la valeur du pas de temps fournie devrait être >= 0, et non %d.

source: The given time step value should be >= %d, and not %d.
fr: la valeur du pas de temps fournie devrait être >= %d, et non %d.

source: Empty MED filename.
fr: Nom de fichier MED vide.

source: MEDfileOpen() failed to open file: %s Associated writer: "%s"
fr: MEDfileOpen() n'a pas pu ouvrir le fichier : %s Gestionnaire associé : "%s"

source: MEDfileClose() failed to close file "%s"
fr: MEDfileClose() n'a pas pu fermer le fichier "%s"

source: MEDfileOpen() failed to re-open file: %s Associated writer: "%s"
fr: MEDfileOpen() n'a pas pu réouvrir le fichier : %s Gestionnaire associé : "%s"

source: Mesh name required to continue.
fr: Un nom de maillage est nécessaire pour continuer.

source: MED must have entities. Mesh: "%s" Writer: "%s"
fr: MED doit avoir des entités. Maillage : "%s" Gestionnaire : "%s"

source: Memory use summary: %s
fr: Bilan de l'occupation mémoire : %s

source: Memory use summary (call %d):
fr: Bilan de l'occupation mémoire (appel %d) :

source: %s : %12.3f %cb
fr: %s : %12.3f %co

source: fixed mesh
fr: maillage fixe

source: transient coordinates
fr: coordonées variables

source: transient connectivity
fr: connectivité variable

source: Format type "%s" required for case "%s" is unknown
fr: Le type de format "%s" demandé pour le cas "%s" est inconnu

source: Format type "%s" required for case "%s" is not available
fr: Le type de format "%s" demandé pour le cas "%s" n'est pas disponible

source: The group or attribute "%s" in the selection criteria: "%s" does not correspond to any boundary face.
fr: Le groupe ou attribut "%s" figurant dans le critère de sélection: "%s" ne correspond à aucune face de bord.

source: The group or attribute "%s" in the selection criteria: "%s" does not correspond to any cell.
fr: Le groupe ou attribut "%s" figurant dans le critère de sélection: "%s" ne correspond à aucune cellule.

source: Periodicity mode "%s" unknown.
fr: Mode de périodicité "%s" inconnu.

source: unknow type %s
fr: type inconnu %s

source: ======================================================== ** Invalid version of the XML file -------------------------------------- XML file version: %.1f XML reader version: %.1f ========================================================
fr: ======================================================== ** Version invalide du fichier XML ------------------------------------------------ Version du fichier XML : %.1f version du lecteur XML : %.1f ========================================================

source: ======================================================== ** Unexpected version XML file version ----------------------------------- XML file version: %.1f XML reader version: %.1f It is recommended to rebuild a new XML file. ========================================================
fr: ======================================================== ** Version inattendue du fichier XML ------------------------------------------------ Version du fichier XML : %.1f version du lecteur XML : %.1f Il est recommandé de reconstruire un nouveau fichier XML. ========================================================

source: Attribute %s has a number of components equal to %d but component %d is requested.
fr: L'attribut %s a %d composantes mais la composante %d est demandée.

source: Error reading main particle restart data.
fr: Erreur à la lecture des données de reprise particulaires.

source: Boundary condition %d not recognized.
fr: La condition limite %d n'est pas reconnue.

source: Error: floating point exception
fr: Erreur : exception en virgule flottante

source: Element selection successfully done.
fr: Sélection d'éléments effectuée.

source: Sorted possible intersections between faces.
fr: Fin du tri des intersection possibles entre faces.

source: Sorting possible intersections between faces: %10.3g
fr: Tri des intersection possibles entre faces : %10.3g

source: Definition of local joining mesh: %10.3g
fr: Définition du maillage de recollement local : %10.3g

source: Edge intersections: %10.3g
fr: Intersections d'arêtes: %10.3g

source: Joining operation is null.
fr: L'opération de recollement est nulle.

source: Joining operation is conforming.
fr: L'opération de recollement est conforme.

source: Joining operation is non-conforming.
fr: L'opération de recollement est non-conforme.

source: Creation of new vertices: %10.3g
fr: Création de nouveaux sommets : %10.3g

source: Edge intersections and vertex creation done.
fr: Intersections d'arêtes et création de sommets terminées.

source: Merging vertices: %10.3g
fr: Fusion de sommets : %10.3g

source: Updating structures with vertex merging: %10.3g
fr: Mises à jour associée à la fusion de sommets : %10.3g

source: Merge vertices and mesh update done.
fr: Fusion de sommets et mise à jour du maillage terminées.

source: Split old faces and reconstruct new faces: %10.3g
fr: Découpage et reconstruction de faces : %10.3g

source: %s Number of cells: %llu Number of interior faces: %llu Number of boundary faces: %llu Number of vertices: %llu
fr: %s Nombre de cellules : %llu Nombre de faces internes : %llu Nombre de faces de bord : %llu Nombre de sommets : %llu

source: ------------------------------------------------------- Joining number %d:
fr: ------------------------------------------------------- Recollement numéro %d :

source: Joining number %d:
fr: Recollement numéro %d:

source: Periodicity type: %s
fr: Type de périodicité : %s

source: Transformation matrix: %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g
fr: Matrice de transformation : %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g %12.5g

source: Selection criteria: "%s"
fr: Critère de sélection : "%s"

source: Parameters for the joining operation: Shortest incident edge fraction: %8.5f Maximum angle between joined face planes: %8.5f
fr: Paramètres de recollement : Fraction de la plus petite arête incidente : %8.5f Angle maximum entre plans de faces recollées : %8.5f

source: Advanced joining parameters: Verbosity level: %8d Visualization level: %8d Deepest level reachable in tree building: %8d Max boxes by leaf: %8d Max ratio of linked boxes / init. boxes: %8.5f Max ratio of boxes for distribution: %8.5f Merge step tolerance multiplier: %8.5f Pre-merge factor: %8.5f Tolerance computation mode: %8d Intersection computation mode: %8d Max. number of equiv. breaks: %8d Max. number of subfaces by face: %8d
fr: Paramètres de recollement avancés : Niveau de verbosité : %8d Niveau de visualisation : %8d Profondeur max. pour construction de l'arbre : %8d Nombre max. de boîtes par feuille : %8d Rapport max. de boîtes liées / initiales : %8.5f Rapport max. de boîtes pour la distribution : %8.5f Multiplicateur de tolérance de fusion : %8.5f Facteur pré-fusion : %8.5f Mode de calcul de la tolérance : %8d Mode de calcul des intersections : %8d Nombre max. de suppressions d'équivalences : %8d Nombre max. de sous-faces par face : %8d

source: Before joining
fr: Avant recollement

source: Joining number %d is not defined.
fr: Le recollement numéro %d n'est pas défini.

source: Unable to open file: "%s" for logging.
fr: Impossibile d'ouvrir le fichier : "%s" pour la trace.

source: Stop joining algorithm: no face selected...
fr: Arrêt du recollement: aucune face sélectionnée...

source: After joining
fr: Après recollement

source: Complete treatment for joining %2d: wall clock time: %10.3g
fr: Traitement complet pour le recollement %2d temps écoulé : %10.3g

source: Error closing log file for joining: %d.
fr: Erreur à la fermeture du fichier de traces pour le recollement : %d.

source: All joining operations successfully finished: Wall clock time: %10.3g
fr: Fin des étapes de recollement : Temps écoulé : %10.3g

source: Joining operations time summary: wall clock time: %10.3g
fr: Temps associés aux étapes de recollement : temps écoulé : %10.3g

source: Determination of possible face intersections: bounding-box tree layout: %dD
fr: Détermination des intersections possibles entre faces : répartition de l'arbre de boîtes englobantes : %dD

source: rank mean minimum maximum depth: %10llu | %10llu | %10llu number of leaves: %10llu | %10llu | %10llu number of boxes: %10llu | %10llu | %10llu leaves over threshold: %10llu | %10llu | %10llu boxes per leaf: %10llu | %10llu | %10llu Memory footprint (kb): final search structure: %10llu | %10llu | %10llu temporary search structure: %10llu | %10llu | %10llu
fr: moyenne des rangs minimum maximum profondeur : %10llu | %10llu | %10llu nombre de feuilles : %10llu | %10llu | %10llu nombre de boîtes : %10llu | %10llu | %10llu feuilles au-dessus du seuil : %10llu | %10llu | %10llu boîtes par feuilles : %10llu | %10llu | %10llu Empreinte mémoire (ko): structure de recherche finale : %10llu | %10llu | %10llu structure intermédiaire : %10llu | %10llu | %10llu

source: depth: %10llu number of leaves: %10llu number of boxes: %10llu leaves over threshold: %10llu boxes per leaf: %10llu mean [%llu min, %llu max] Memory footprint (kb): final search structure: %10llu temporary search structure: %10llu
fr: profondeur : %10llu nombre de feuilles : %10llu nombre de boîtes : %10llu feuilles au-dessus du seuil : %10llu boîtes par feuille : %10llu moyenne [%llu min, %llu max] Empreinte mémoire (ko) : structure de recherche finale : %10llu structure intermédiaire : %10llu

source: Associated times: Face bounding boxes tree construction: %10.3g Face bounding boxes neighborhood query: %10.3g
fr: Temps associés : Construction des boîtes englobantes de faces : %10.3g Recherche des boîtes englobantes voisines : %10.3g

source: Equivalences broken for %llu edges.
fr: Equivalences cassées pour %llu éléments.

source: Max. number of equiv. breaks: %llu
fr: Nombre max d'équivalences cassées : %llu

source: Global number of intersections detected: %12llu Vertex-Vertex intersections: %12llu Other intersections: %12llu
fr: Nombre global d'intersections détectées : %12llu Intersections sommet-sommet : %12llu Autres intersections : %12llu

source: Pre-merge for %llu global element couples.
fr: Pré-fusion pour %llu couples globaux d'éléments.

source: No need to merge vertices.
fr: Pas besoin de fusionner des sommets.

source: Max size of a merge set of vertices: %llu
fr: Taille max d'un ensemble de fusion de sommets : %llu

source: Excessive transitivity for %llu set(s) of vertices.
fr: Transitivité excessive pour %llu ensembles de sommets.

source: Max. number of iterations to solve transitivity excess: %llu
fr: Nombre max d'itérations pour résoudre un excès de transitivité : %llu

source: Global number of new vertices to create: %10llu
fr: Nombre global de nouveaux sommets à créer : %10llu

source: Merging of equivalent vertices done.
fr: Fusion des sommets équivalents terminée.

source: Global number of selected vertices: %11llu
fr: Nombre global de sommets sélectionnés : %11llu

source: Number of selected vertices: %11llu
fr: Nombre global de sommets sélectionnés : %11llu

source: The simplified face has less than 3 vertices. Check your joining parameters. Face %d (%llu)
fr: La face simplifiée a moins de 3 sommets. Vérifier les paramètres de recollement. Face %d (%llu)

source: Number of simplified faces: %llu
fr: Nombre de faces simplifiées : %llu

source: Rank
fr: Rang

source: Global number of faces after splitting: %10llu
fr: Nombre global de faces après subdivision : %10llu

source: *** WARNING *** Globally, %llu problem(s) found during the face splitting %12llu open cycles, %12llu edges traversed twice, %12llu faces split into more than max_subfaces (= %d) => Eventually modify joining parameters
fr: *** ATTENTION *** Globalement, %llu problème(s) trouvé(s) pendant la subdivision des faces %12llu cycles ouverts, %12llu arêtes parcourues deux fois, %12llu faces subdivisées en plus de max_subfaces (= %d) => Modifier éventuellement les paramètres de recollement

source: Cannot achieve to reorient the current joined face.
fr: Ne parvient pas à réorienter la face recollée en cours.

source: Global number of multiple border faces: %10llu
fr: Nombre global de faces de bord multiples : %10llu

source: Mesh cleaning done for degenerate faces. Global number of cleaned interior faces: %8llu Global number of cleaned border faces: %8llu
fr: Nettoyage du maillage pour des faces dégénérées. Nombre global de faces intérieures nettoyées : %8llu Nombre global de faces de bord nettoyées : %8llu

source: Global number of single vertices found: %6llu
fr: Nombre global de sommets solitaires repérés : %6llu

source: Global number of single edges found: %6llu
fr: Nombre global d'arêtes solitaires repérées : %6llu

source: Mesh joining: Forbidden value for the fraction parameter. It must be between [0.0, 1.0[ and is here: %f
fr: Recollement de maillage : valeur interdite pour le paramètre de fraction. Il doit être entre [0.0, 1.0[ et vaut ici : %f

source: Mesh joining: Forbidden value for the plane parameter. It must be between [0, 90] and is here: %f
fr: Recollement de maillage : valeur interdite pour le paramètre de plan. Il doit être entre [0, 90[ et vaut ici : %f

source: The log directory cannot be created
fr: Le répertoire de traces (log) ne peut être créé

source: Global number of boundary faces selected for joining: %10llu
fr: Nombre global de faces frontières sélectionnées pour le recollement : %10llu

source: Inconsistent mesh definition. Cannot build edges. Face %d has the same vertex %d twice.
fr: Définition de maillage incohérente. Ne peut pas construire les arêtes. La Face %d contient deux fois le sommet %d.

source: Criterion 1: Orthogonality:
fr: Critère 1 : orthogonalité :

source: Number of bad cells detected: %llu --> %3.0f %%
fr: Nombre de mauvaises cellules détecté : %llu --> %3.0f %%

source: Criterion 2: Offset:
fr: Critère 2 : décentrement :

source: Criterion 3: Least-Squares Gradient Quality:
fr: Critère 3 : qualité du gradient moindres-carrés :

source: Criterion 4: Cells Volume Ratio:
fr: Critère 4 : ratio des volumes de cellules :

source: Criterion 5: Guilt by Association:
fr: Critère 5 : culpabilité par association :

source: Warning: -------- Mesh quality issue has been detected The mesh should be re-considered using the listed criteria. The calculation will run but the solution quality may be degraded...
fr: Attention : --------- Un défaut de qualité de maillage a été détecté Le maillage devrait être revu en fonction des critères indiqués. Le calcul sera effectué mais la qualité de la solution peut être dégradée...

source: Synchronizing cell families
fr: Synchronisation des familles des cellules

source: minimum value = %10d
fr: valeur minimale = %10d

source: maximum value = %10d
fr: valeur maximale = %10d

source: Halo creation times summary
fr: Bilan des temps pour la création du halo

source: Interface creation: %.3g s
fr: Création de l'interface : %.3g s

source: Extended connectivity creation: %.3g s
fr: Création de la connectivité étendue : %.3g s

source: Halo creation: %.3g s
fr: Création du halo : %.3g s

source: Total time for halo creation: %.3g s
fr: Temps total de création du halo : %.3g s

source: Histogram of the number of interior faces per cell:
fr: Histogramme du nombre de faces internes par cellule :

source: Periodic faces (which are also interior faces):
fr: Faces périodiques (qui sont aussi des faces intérieures) :

source: Periodicity %2d: %llu face couples
fr: Périodicité %2d : %llu couples de faces

source: Groups:
fr: Groupes :

source: cells: %12llu
fr: cellules : %12llu

source: interior faces: %12llu
fr: faces intérieures : %12llu

source: boundary faces: %12llu
fr: faces de bord : %12llu

source: isolated faces: %12llu
fr: faces isolées : %12llu

source: Histogram of the number of cells per rank:
fr: Histogramme de la distribution du nombre de cellules sur les rangs :

source: Number of cells: %d
fr: Nombre de cellules : %d

source: Histogram of the number of standard + halo cells per rank:
fr: Histogramme de la distribution du nombre de cellules standard + halo sur les rangs :

source: Number of cells + halo cells: %d
fr: Nombre de cellules + cellules halo : %d

source: Histogram of the number of ghost cells per rank:
fr: Histogramme de la distribution des cellules fantômes sur les rangs :

source: Histogram of the number of ghost cells in the standard neighborhood per rank:
fr: Histogramme de la distribution des cellules fantômes dans le voisinage standard sur les rangs :

source: Number of ghost cells: %10d
fr: Nombre de cellules fantômes : %10d

source: in the standard neighborhood: %10d
fr: dans le voisinage standard : %10d

source: Histogram of the number of interior faces per rank:
fr: Histogramme de la distribution du nombre de faces interne sur les rangs :

source: Number of interior faces: %d
fr: Nombre de faces internes : %d

source: Histogram of the number of boundary faces per rank:
fr: Histogramme de la distribution du nombre de faces de bord sur les rangs :

source: Number of boundary faces: %d
fr: Nombre de faces de bord : %d

source: Histogram of the number of neighboring domains per rank:
fr: Histogramme de la distribution du nombre de domaines voisins sur les rangs :

source: Removed %llu isolated faces Number of initial vertices: %llu Number of vertices: %llu
fr: %llu faces isolées supprimées Nombre de sommets initiaux : %llu Nombre de sommets : %llu

source: Global definition of the number of elements (cells, vertices, faces...)
fr: Définition globale du nombre d'éléments (cellules, sommets, faces...)

source: Composing periodicities
fr: Composition des périodicités

source: Halo construction with extended neighborhood ============================================
fr: Construction du halo avec voisinage étendu ==========================================

source: Halo construction with standard neighborhood ============================================
fr: Construction du halo avec voisinage standard ============================================

source: Face interfaces creation
fr: Création de l'interface entre faces

source: Definition of periodic vertices
fr: Définition des sommets périodiques

source: Vertex interfaces creation
fr: Création de l'interface entre sommets

source: Halo creation
fr: Création des halos

source: Halo definition
fr: Définition des halos

source: Extended neighborhood structures definition
fr: Définition des structures pour le voisinage étendu

source: Extended connectivity creation (%.3g s)
fr: Création de la connectivité étendue (%.3g s)

source: Mesh coordinates: minimum and maximum X : %14.7e %14.7e Y : %14.7e %14.7e Z : %14.7e %14.7e
fr: Coordonnées du maillage minimale et maximale X : %14.7e %14.7e Y : %14.7e %14.7e Z : %14.7e %14.7e

source: Number of isolated faces: %llu
fr: Nombre de faces isolées : %llu

source: Checking the face -> cells connectivity coherency
fr: Test de cohérence de la connectivité faces -> cellules
