Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: Value type <%d> given for a restart file section is invalid using the Fortran API.
fr: Le type de valeur <%d> indiqué pour une rubrique de fichier de reprise de calcul est invalide pour l'interface Fortran.

source: The %s directory cannot be created
fr: Le répertoire %s ne peut être créé

source: The %s directory cannot be found
fr: Le répertoire %s ne peut pas être trouvé

source: The size of location "%s" associated with the restart file "%s" is %llu and does not correspond to that of the current mesh (%llu).
fr: La taille du support "%s" associé au fichier de reprise de calcul "%s" vaut %llu et ne correspond pas à celle du maillage en cours (%llu).

source: The restart file "%s" references no location named "%s".
fr: "Le fichier de reprise de calcul \"%s\" ne contient \n" " aucun support de nom \"%s\"."

source: Location: %s (number: %03d, n_glob_ents: %llu)
fr: Support : %s (numéro : %03d, n_glob_ents : %llu)

source: General information associated with the restart file:
fr: Informations générales associées au fichier de reprise de calcul :

source: Checkpoint / restart files summary: Number of files read: %3d Number of files written: %3d Elapsed time for reading: %12.3f Elapsed time for writing: %12.3f
fr: Bilan des écriture / lecture des fichiers de redémarrage : Nombre de fichiers lus : %3d Nombre de fichiers écrits : %3d Temps écoulé pour la lecture : %12.3f Temps écoulé pour l'écriture : %12.3f

source: Error reading variable information in restart file "%s".
fr: Erreur à la lecture des informations sur les variables dans le fichier de reprise "%s".

source: Error %d reading "%s" in restart file "%s".
fr: Erreur %d à la lecture de "%s" dans le fichier de reprise "%s".

source: Error reading turbulence model info from restart file "%s".
fr: Erreur à la lecture du modèle de turbulence dans le fichier de reprise "%s".

source: Error reading turbulence variables from previous model in restart file "%s".
fr: Erreur à la lecture des variables turbulentes d'un modèle précédent dans le fichier de reprise "%s".

source: Error reading velocity/pressure values in restart file "%s".
fr: Erreur à la lecture des valeurs de vitess/pression dans le fichier de reprise "%s".

source: Read variables from restart: %s
fr: Variables lues dans le fichier de reprise : %s

source: Wrote main variables to checkpoint: %s
fr: Variables principales écrites dans le fichier de reprise : %s

source: %s: no matching data for field "%s"
fr: %s : pas de données correspondantes au champ "%s"

source: (was named "%s")
fr: (anciennement nommé "%s")

source: Some boundary condition coefficients could not be read from a restart file; they will be initialized with default values.
fr: Certains coefficients de conditions aux limites n'ont pu être lus depuis le fichier de reprise ; ils seront initialisés avec des valeurs par défaut.

source: Wrote boundary condition coefficients to checkpoint: %s
fr: Coefficients de C.L. écrits dans le fichier de reprise : %s

source: Code_Saturne coupling: coupling id: %d local name: "%s"
fr: Couplage Code_Saturne : id de couplage : %d nom local : "%s"

source: Code_Saturne coupling %d: initializing MPI communication ...
fr: Couplage Code_Saturne %d : initialisation de la communication MPI ...

source: Local ranks = [%d..%d], distant ranks = [%d..%d].
fr: Rangs locaux = [%d..%d], rangs distants = [%d..%d].

source: Code_Saturne coupling: coupling id: %d local name: "%s" distant application name: "%s" MPI application id: %d MPI root rank: %d number of MPI ranks: %d
fr: Couplage Code_Saturne : id de couplage : %d nom local : "%s" nom d'application distante : "%s" numéro d'application MPI : %d rang racine MPI : %d nombre de rangs MPI : %d

source: Impossible coupling number %d; there are %d couplings
fr: Numéro de couplage %d impossible ; on a %d couplages

source: Coupling %d: inconsistent arguments for LELCPL() NCECPL = %d and NFBCPL = %d are indicated. The values for this coupling should be %d and %d.
fr: Couplage %d: arguments incohérents pour LELCPL(). On a indiqué NCECPL = %d et NFBCPL = %d. On devrait avoir les valeurs %d et %d pour ce couplage.

source: Coupling %d: inconsistent arguments for LELNCP() NCENCP = %d and NFBNCP = %d are indicated. The values for this coupling should be %d and %d.
fr: Couplage %d: arguments incohérents pour LELNCP(). On a indiqué NCENCP = %d et NFBNCP = %d. On devrait avoir les valeurs %d et %d pour ce couplage.

source: Coupling %d: inconsistent arguments for COOCPL() ITYDIS = %d and NBRPTS = %d are indicated. The value for NBRPTS should be %d.
fr: Couplage %d: arguments incohérents pour COOCPL(). On a indiqué ITYDIS = %d et NBRPTS = %d. On devrait avoir la valeur %d pour NBRPTS.

source: Coupling %d: inconsistent arguments for PNDCPL(). ITYLOC = %d and NBRPTS = %d are indicated. NBRPTS should be %d.
fr: Couplage %d: arguments incohérents pour PNDCPL(). On a indiqué ITYLOC = %d et NBRPTS = %d. On devrait avoir la valeur %d pour NBRPTS.

source: Coupling %d: inconsistent arguments for VARCPL() ITYVAR = %d and NBRDIS = %d are indicated. NBRDIS should be 0 or %d.
fr: Couplage %d: arguments incohérents pour VARCPL(). On a indiqué ITYVAR = %d et NBRDIS = %d. On devrait avoir la valeur 0 ou %d pour NBRDIS.

source: Coupling %d: inconsistent arguments for VARCPL() ITYVAR = %d and NBRLOC = %d are indicated. NBRLOC should be 0 or %d.
fr: Couplage %d: arguments incohérents pour VARCPL(). On a indiqué ITYVAR = %d et NBRLOC = %d. On devrait avoir la valeur 0 ou %d pour NBRLOC.

source: At least 1 Code_Saturne coupling was defined for which no communication with a Code_Saturne instance is possible.
fr: Au moins 1 couplage Code_Saturne a été défini pour lequel aucune communication avec une instance de Code_Saturne n'est possible.

source: The group "%s" in the selection criteria: "%s" does not correspond to any boundary face.
fr: Le groupe ou attribut "%s" figurant dans le critère de sélection: "%s" ne correspond à aucune face de bord.

source: The group "%s" in the selection criteria: "%s" does not correspond to any interior face.
fr: Le groupe "%s" figurant dans le critère de sélection: "%s" ne correspond à aucune face interne.

source: The group "%s" in the selection criteria: "%s" does not correspond to any cell.
fr: Le groupe "%s" figurant dans le critère de sélection: "%s" ne correspond à aucune cellule.

source: The group "%s" in the selection criteria: "%s" is not present in the mesh.
fr: Le groupe "%s" figurant dans le critère de sélection: "%s" n'est pas présent dans le maillage.

source: SYRTHES coupling %d: initializing MPI communication ...
fr: Couplage SYRTHES %d : initialisation de la communication MPI ...

source: Solid T
fr: T solide

source: Solid heat flux
fr: flux thermique solide

source: Extracting coupled mesh ...
fr: Extraction du maillage couplé ...

source: SYRTHES %s cells
fr: Cellules SYRTHES %s

source: SYRTHES %s faces
fr: Faces SYRTHES %s

source: Selection criteria: "%s" leads to an empty mesh for SYRTHES coupling.
fr: Le critère de sélection : "%s" produit un maillage vide pour le couplage SYRTHES.

source: Projecting the extracted mesh to 2D ...
fr: Projection 2D du maillage extrait ...

source: Error projecting the extracted mesh.
fr: Erreur lors de la projection du maillage extrait.

source: Extracted mesh built of %llu elements.
fr: Maillage extrait composé de %llu éléments.

source: Locator structure and mesh creation ...
fr: Création de la structure de localisation et du maillage ...

source: [failed]
fr: [échec]

source: %llu fluid mesh elements not located on solid mesh
fr: %llu éléments de maillage fluide non localisés sur la maillage solide

source: Some solid mesh elements not located on fluid mesh
fr: Certains éléments du maillage solide non localisés sur maillage fluide

source: Extending search with tolerance factor %f...
fr: Extension de la recherche avec facteur de tolérance %f...

source: Coupling with SYRTHES impossible: %llu element centers from mesh "%s" not located on SYRTHES mesh.
fr: Couplage avec SYRTHES impossible : %llu centres d'éléments du maillage "%s" non localisés sur le maillage SYRTHES.

source: SYRTHES 4 coupling overheads
fr: Surcoûts de couplage avec SYRTHES 4

source: coupling %d (%s):
fr: couplage %d (%s) :

source: location time: %12.3f communication and wait: %12.3f variable exchange time: %12.3f communication and wait: %12.3f
fr: temps de localisation : %12.3f communication et attente : %12.3f temps d'échange de variables : %12.3f communication et attente : %12.3f

source: Coupling with SYRTHES impossible. No selection criteria for faces or cells to couple.
fr: Couplage avec SYRTHES impossible. Aucun critère de sélection pour les faces ou les cellules à coupler.

source: Structures associated with SYRTHES 4 coupling freed.
fr: Libération des structures associées au couplage avec SYRTHES 4.

source: ======================================================== ** Incompatible SYRTHES coupling options: ------------------------------------------------ Code_Saturne options: "%s" SYRTHES options: "%s" ========================================================
fr: ======================================================== ** Options de couplage avec SYRTHES incompatibles : ------------------------------------------------ Options Code_Saturne : "%s" Options SYRTHES : "%s" ========================================================

source: ** Processing the mesh for SYRTHES coupling "%s"
fr: ** Traitement du maillage pour le couplage SYRTHES "%s"

source: Message received from SYRTHES: "%s" indicates meshes have not been matched correctly. The calculation will not run.
fr: Le message reçu de SYRTHES: "%s" indique que les maillages ne correspondent pas correctement. Le calcul ne sera pas exécuté.

source: Message received from SYRTHES: "%s" indicates an error or is unexpected.
fr: Le message reçu de SYRTHES: "%s" indique une erreur ou est inattendu.

source: ** Mesh located for SYRTHES coupling "%s".
fr: ** Localisation du maillage pour le couplage SYRTHES "%s".

source: SYRTHES coupling: coupling id: %d local name: "%s"
fr: Couplage SYRTHES : id de couplage : %d nom local : "%s"

source: SYRTHES coupling: coupling id: %d version: "%s" local name: "%s" distant application name: "%s" MPI application id: %d MPI root rank: %d number of MPI ranks: %d
fr: Couplage SYRTHES : id de couplage : %d version : "%s" nom local : "%s" nom d'application distante : "%s" numéro d'application MPI : %d rang racine MPI : %d nombre de rangs MPI : %d

source: SYRTHES coupling number %d impossible; there are %d couplings
fr: Numéro de couplage SYRTHES %d impossible ; on a %d couplages

source: At least 1 SYRTHES coupling was defined for which no communication with a SYRTHES instance is possible.
fr: Au moins 1 couplage SYRTHES a été défini pour lequel aucune communication avec une instance de SYRTHES n'est possible.

source: Local case configuration:
fr: Configuration locale du cas :

source: System:
fr: Système :

source: Processor:
fr: Processeur :

source: Memory:
fr: Mémoire :

source: MB
fr: Mo

source: User:
fr: Utilisateur :

source: Directory:
fr: Répertoire :

source: MPI ranks:
fr: Rangs MPI :

source: Torus dimensions:
fr: Dimensions du tore :

source: Hardware threads:
fr: Threads matériels :

source: Block shape:
fr: Forme de bloc :

source: Torus links enabled:
fr: Liens du tore actifs :

source: appnum attribute:
fr: attribut appnum :

source: OpenMP threads:
fr: Threads OpenMP :

source: Dynamic scheduling allowed
fr: Ordonnancement dynamique possible

source: Processors/node:
fr: Processeurs/noeud :

source: mean
fr: moyenne

source: variance
fr: variable

source: Error reading expected section in restart file.
fr: Erreur à la lecture d'une section attendue dans un fichier de reprise.

source: Restart data for time moment "%s" (previously "%s") does not match. previous values: weight accumulator location_id: %d type: %d location_id: %d dimension: %d start time step: %d start time: %12.5e
fr: Les donées de reprise pour le moment temporel "%s" (anciennement "%s") ne correspondent pas. valeurs précédentes: id support accumulateur poids : %d type: %d id support %d dimension: %d pas de temps de départ : %d temps de départ : %12.5e

source: Warning: computation of time moment "%s" will be reset, as restart data for "%s" does not match.
fr: Attention: le calcul du moment temporel "%s" sera remis à zéro, car les données de reprise pour "%s" ne correspondent pas.

source: Restart data for time moment "%s" (previously "%s") does not match.
fr: Les données de reprise pour le moment temporel "%s" (anciennement "%s") ne correpondent pas.

source: Warning: computation of time moment "%s"will be reset, as restart data for "%s" is not available.
fr: Attention: le calcul du moment temporel "%s" sera remis à zéro, car les données de reprise pour "%s" ne sont pas disponibles.

source: Restart data for time moment "%s" (previously "%s") not available.
fr: Les données de reprise pour le moment temporel "%s" (anciennement "%s") ne sont pas disponibles.

source: Restart data for time moment "%s" (previously "%s") seems inconsistent: lower order moment of type %s was "%s", but has non-matching attributes: weight accumulator id: %d (expected %d) type: %d location_id: %d dimension: %d
fr: Les données de reprise pour le moment temporel "%s" (anciennement "%s") semblent incohérentes : le moment d'ordre inférieur de type %s était "%s", mais a des attributs qui ne correspondent pas : id accumulateur poids : %d (attendu %d) type: %d id support: %d dimension: %d

source: Definition of simple data requires at least one field id.
fr: La définition de données simples nécessite ua moins un id de champ

source: Definition of simple data used for %s: %s mixes fields with location id %d and location id %d.
fr: La définition de données simples utilisée pour %s : %s mélange des champs avec support %d et support %d.

source: Definition of simple data used for %s: %s includes field of dimension different from 1, 3, 6, or 9. The definition must be split.
fr: La définition de données simples utilisée pour %s: %s inclut un champ de dimension différente de 1, 3, 6, ou 9. La définition doit être découpée.

source: Definition of simple data used for %s: %s leads to a field of dimension > 9. The definition must be split.
fr: La définition de données simples utilisée pour %s: %s Mène à un champ de dimension > 9. La définition doit être découpée.

source: Definition of simple data used for %s: %s includes a component id incompatible with field dimension.
fr: La définition de données simples utilisée pour %s: %s inclut un id. de composante incompatible avec le définition du champ.

source: Weighting of time-value moments for mesh locations of type: %s is not currently supported.
fr: La pondération de moments temporels pour des supports de type : %s n'est pas encore supportée.

source: Temporal moments ----------------
fr: Moments temporels -----------------

source: Accumulator
fr: Accumulateur

source: Start
fr: Début

source: Weight
fr: Poids

source: Lower
fr: Inf.

source: ** Temporal moment accumulated weights -----------------------------------
fr: ** Poids cumulés pour moments temporels ------------------------------------

source: location
fr: support

source: Error opening file: "%s"
fr: Erreur à l'ouverture du fichier "%s".

source: # Time varying values for: %s #
fr: # Valeurs dépendantes du temps pour : %s #

source: # Monitoring point coordinates:
fr: # Cordonnées des sondes :

source: # Columns:
fr: # Colonnes :

source: # %d: Time step number
fr: # %d: Numéro de pas de temps

source: # %d: Physical time
fr: # %d: Temps physique

source: # %d - : Values at monitoring points
fr: # %d - : Valeurs aux sondes

source: Error closing file: "%s"
fr: Erreur à la fermeture du fichier "%s".

source: # Number of structures: %d #
fr: # Nombre de structures: %d #

source: Error re-opening file: "%s"
fr: Erreur à la ré-ouverture du fichier "%s"

source: Error writing file: "%s"
fr: Erreur à l'écriture du fichier "%s"

source: Abort while opening the 1D-wall thermal module restart file in read mode. Verify the existence and the name of the restart file: %s
fr: Arret à l'ouverture en lecture du fichier de reprise de calcul du module thermique 1D en paroi. Vérifier l'existence et le nom du fichier de reprise de calcul: %s

source: Abort while reading the 1D-wall thermal module restart file. The number of boundary faces has been modified Verify that the restart file corresponds to the present study.
fr: Arrêt de lecture du fichier de reprise de calcul du module thermique 1D en paroi. Le nombre de faces de bord a été modifié Vérifier que le fichier de reprise de calcul correspond bien au cas traité.

source: WARNING: ABORT WHILE READING THE RESTART FILE ******** 1D-WALL THERMAL MODULE INCORRECT FILE TYPE The file %s does not seem to be a restart file for the 1D-wall thermal module. The calculation will not be run. Verify that the restart file corresponds to a restart file for the 1D-wall thermal module.
fr: ATTENTION : ARRET A LA LECTURE DU FICHIER SUITE ********* MODULE THERMIQUE 1D EN PAROI TYPE DE FICHIER INCORRECT Le fichier %s ne semble pas etre un fichier de reprise de calcul de module thermique 1D en paroi. Le calcul ne peut etre execute. Verifier que le fichier de reprise de calcul utilise correspond bien a un fichier de reprise de calcul de module thermique 1D en paroi.

source: Problem while reading section in the restart file for the 1D-wall thermal module: <%s> The calculation will not be run.
fr: Problème à la lecture de la rubrique dans le fichier de reprise de calcul du module thermique 1D en paroi: <%s> Le calcul ne sera pas executé.

source: WARNING: ABORT WHILE READING THE RESTART FILE ******** 1D-WALL THERMAL MODULE CURRENT AND PREVIOUS DATA ARE DIFFERENT The number of faces with 1D thermal module has been modified. PREVIOUS: %d boundary faces (total) CURRENT: %d boundary faces (total) The calculation will not be run. Verify that the restart file corresponds to a restart file for the 1D-wall thermal module. Verify uspt1d.
fr: ATTENTION : LECTURE DU FICHIER SUITE ********* MODULE THERMIQUE 1D EN PAROI DONNEES AMONT ET ACTUELLES DIFFERENTES Le nombre de faces avec module thermique 1D a été modifié. AMONT : %d faces de bord au total ACTUEL : %d faces de bord au total Le calcul ne peut être exécuté. Vérifier que le fichier de reprise de calcul utilisé correspond bien au cas traité. Vérifier uspt1d.

source: WARNING: ABORT WHILE READING THE RESTART FILE ******** 1D-WALL THERMAL MODULE CURRENT AND PREVIOUS DATA ARE DIFFERENT IFPT1D or NPPT1D has been modified with respect to the restart file on at least on face with 1D thermal module The calculation will not be run. Verify that the restart file correspond to the present study. Verify uspt1d (refer to the user manual for the specificities of the test on IFPT1D)
fr: ATTENTION : LECTURE DU FICHIER SUITE ********* MODULE THERMIQUE 1D EN PAROI DONNEES AMONT ET ACTUELLES DIFFERENTES IFPT1D ou NPPT1D a été modifié par rapport au fichier de reprise de calcul sur au moins une face avec module thermique 1D. Le calcul ne peut être executé. Vérifier que le fichier de reprise de calcul utilisé correspond bien au cas traité. Vérifier uspt1d (se reporter à la documentation utilisateur pour les spécificités du test sur IFPT1D)

source: WARNING: ABORT WHILE READING THE RESTART FILE ******** 1D-WALL THERMAL MODULE CURRENT AND PREVIOUS DATA ARE DIFFERENT The parameter EPPT1D has been modified with respect to the restart file on at least on face with 1D thermal module The calculation will not be run. Verify that the restart file corresponds to the present study. Verify uspt1d
fr: ATTENTION : LECTURE DU FICHIER SUITE ********* MODULE THERMIQUE 1D EN PAROI DONNEES AMONT ET ACTUELLES DIFFERENTES Le paramètre EPPT1D a été modifié par rapport au fichier fichier de reprise de calcul sur au moins une face avec module thermique 1D. Le calcul ne peut être exécuté. Vérifier que le fichier de reprise de calcul utilisé correspond bien au cas traité. Vérifier uspt1d.

source: WARNING: ABORT WHILE READING THE RESTART FILE ******** 1D-WALL THERMAL MODULE CURRENT AND OLD DATA ARE DIFFERENT The parameter RGPT1D has been modified with respect to the restart file on at least on face with 1D thermal module The calculation will not be run. Verify that the restart file correspond to the present study Verify uspt1d
fr: ATTENTION : LECTURE DU FICHIER SUITE ********* MODULE THERMIQUE 1D EN PAROI DONNEES AMONT ET ACTUELLES DIFFERENTES Le parametre RGPT1D a été modifié par rapport au fichier fichier de reprise de calcul sur au moins une face avec module thermique 1D. Le calcul ne peut être exécuté. Vérifier que le fichier de reprise de calcul utilise correspond bien au cas traité. Verifier uspt1d.

source: Problem while reading the section in the restart file for the 1D-wall thermal module: <%s>
fr: Problème à la lecture de la rubrique dans le fichier de reprise de calcul du module thermique 1D en paroi: <%s>

source: Abort while opening the 1D-wall thermal module restart file in write mode. Verify the existence and the name of the restart file: %s
fr: Arret à l'ouverture en écriture du fichier de reprise de calcul du module thermique 1D en paroi. Vérifier l'existence et le nom du fichier de reprise de calcul: %s

source: %s: some faces of the initial mesh belong to different rotor/stator sections. These sections must be initially disjoint to rotate freely.
fr: %s: certaine faces du maillage initial appartiennent à différentes sections de rotor/stator. Ces sections doivent être initiallement disjointes pour tourner librement.

source: Added boundary faces
fr: Faces de bord ajoutées

source: Error in turbomachinery mesh update: Number of boundary faces has changed from %llu to %llu. There are probably unjoined faces, due to an insufficiently regular mesh; adjusting mesh joining parameters might help.
fr: Erreur dans la mise à jour d'un maillage de turbomachine : Le nombre de faces frontières est passé de %llu à %llu. Il y a probablement des faces non recollées, dues à un maillage trop irrégulier ; il peut être utile d'ajuster les paramètres de recollement.

source: WARNING: non-convergence in the computation ******** of the friction velocity face number: %d friction vel: %f
fr: ATTENTION : non-convergence du calcul ********* de la vitesse de frottement face numéro : %d vitesse de frottement : %f

source: Abort while opening the cooling tower module restart file in write mode. Verify the existence and the name of the restart file: %s
fr: Arret à l'ouverture en écriture du fichier de reprise de calcul aéroréfrigérants. Vérifier l''existence et le nom du fichier de reprise de calcul: %s

source: Abort while opening the cooling tower AERO module restart file in read mode. Verify the existence and the name of the restart file: %s
fr: Arret à l'ouverture en lecture du fichier de reprise de calcul aéroréfrigérants. Vérifier l'existence et le nom du fichier de reprise de calcul: %s

source: Problem while reading section in the restart file for the cooling tower module: <%s> The calculation will not be run.
fr: Problème à la lecture de la rubrique dans le fichier de reprise de calcul du module aéroréfrigérants : <%s> Le calcul ne sera pas executé.
