Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: Internal face -> cells connectivity value not initialized for face: %d (cell_num1 = %d and cell_num2 = %d)
fr: Valeur de connectivité faces -> cellules pas initialisée pour la face : %d (num_cell1 = %d et num_cell2 = %d)

source: Coherency error in %s halo between cell %ld with: bounding box min: [%12.6g %12.6g %12.6g] max: [%12.6g %12.6g %12.6g] and cell %ld with: bounding box min: [%12.6g %12.6g %12.6g] max: [%12.6g %12.6g %12.6g]
fr: Erreur de cohérence dans le halo %s entre la cellule %ld avec : bornes min: [%12.6g %12.6g %12.6g] max: [%12.6g %12.6g %12.6g] et la cellule %ld avec : bornes min: [%12.6g %12.6g %12.6g] max: [%12.6g %12.6g %12.6g]

source: Checking the mesh structure coherency:
fr: Tests de cohérence de la structure de maillage :

source: Coherency criteria definition
fr: Définition des critères de cohérence

source: Coherency verification on coordinates
fr: Vérification de cohérence sur coordonnées

source: extended
fr: étendu

source: End of coherency check of the mesh structure.
fr: Fin des tests de cohérence de la structure de maillage.

source: The main mesh does not contain any face -> vertices connectivity, necessary for the nodal connectivity reconstruction (cs_mesh_connect_cells_to_nodal).
fr: Le maillage principal ne contient pas de connectivité faces->sommets, indispensable à la reconstruction de la connectivité nodale (cs_mesh_connect_cells_to_nodal).

source: The main mesh does not contain any face -> vertices connectivity, necessary for the nodal connectivity reconstruction (cs_mesh_connect_faces_to_nodal).
fr: Le maillage principal ne contient pas de connectivité faces->sommets, indispensable à la reconstruction de la connectivité nodale (cs_mesh_connect_faces_to_nodal).

source: Number of cells on rank %d is zero. (number of cells / number of processes ratio too low).
fr: Le nombre de cellules pour le rang %d est nul. (rapport nombre de cellules / nombre de processeurs trop faible).

source: Repeated inconsistency in the halo construction. Several local points have the same distant correspondant; this is probably a side effect of a poor quality joining or periodicity. Coordinates of the first impacted point: [%12.5e, %12.5e %12.5e].
fr: Incohérence repérée lors de la construction du halo. Plusieurs points locaux ont le même correspondant distant ; ceci est probablement dû à un effet de bord d'un maillage de mauvaise qualité généré durant l'étape de recollement ou de périodicité. Coordonnées du premier point impacté: [%12.5e, %12.5e %12.5e].

source: Halo cleaning
fr: Nettoyage des halos

source: Distant halo creation
fr: Création du halo distant

source: Updating the faces -> cells connectivity
fr: Mise à jour de la connectivité faces -> cellules

source: cells
fr: cellules

source: vertices
fr: sommets

source: particles
fr: particules

source: other
fr: autre

source: The requested mesh location %d is not defined.
fr: Le support de maillage demandé %d n'est pas défini.

source: interior_faces
fr: faces intérieures

source: boundary_faces
fr: faces de bord

source: Histogram of the interior faces warping:
fr: Histogramme du gauchissement des faces internes :

source: Histogram of the boundary faces warping:
fr: Histogramme du gauchissement des faces de bord:

source: Histogram of the interior faces weighting coefficient:
fr: Histogramme des coefficients de pondération des faces internes :

source: Histogram of the interior faces off-centering coefficient:
fr: Histogramme des coefficients de décentrement des faces internes :

source: Histogram of the interior faces non-orthogonality coefficient (in degrees):
fr: Histogramme de la non-orthogonalité des faces internes (en degrés) :

source: Histogram of the boundary faces non-orthogonality coefficient (in degrees):
fr: Histogramme de la non-orthogonalité des faces de bord (en degrés) :

source: Histogram of cell volumes:
fr: Histogramme du volume des cellules :

source: Face geometric quantities computation is only implemented in 3D.
fr: Le calcul des grandeurs géométriques associées aux faces ne sont implantés qu'en 3D.

source: Face surface computation is only implemented in 3D.
fr: Le calcul des surfaces des faces n'est implanté qu'en 3D.

source: Cell center computation is only implemented in 3D.
fr: Le calcul des centres des cellules n'est implanté qu'en 3D.

source: The algorithm selection indicator for the cell center of gravity computation can take the following values: 0: computation based on the face centers and surfaces 1: computation based on the vertices and not %d.
fr: L'indicateur de choix d'algorithme de calcul du centre de gravité des cellules peut prendre les valeurs suivantes : 0 : calcul basé sur les centres et surfaces des faces 1 : calcul basé sur les sommets et non %d.

source: --- Information on the volumes Minimum control volume = %14.7e Maximum control volume = %14.7e Total volume for the domain = %14.7e
fr: --- Information sur les volumes Volume de controle minimal = %14.7e Volume de controle maximal = %14.7e Volume total du domaine = %14.7e

source: %llu cells have a Negative volume. Run mesh quality check for post-processing output. In case of mesh joining, this may be due to overly agressive joining parameters.
fr: %llu cellules ont un volume négatif. Lancez la vérification de qualité du maillage pour une sortie visualisable. En cas de recollement de maillage, ceci peut être dû à des paramètres de recollement trop agressifs.

source: Histogram of the boundary faces warping before unwarping algorithm:
fr: Histogramme du gauchissement des faces de bord avant dégauchissement :

source: Histogram of the interior faces warping before unwarping algorithm:
fr: Histogramme du gauchissement des faces intérieures avant dégauchissement :

source: Unwarping algorithm failed.
fr: Échec de l'algorithme de dégauchissement.

source: Histogram of the boundary faces warping after unwarping algorithm:
fr: Histogramme du gauchissement des faces de bord après dégauchissement :

source: Histogram of the interior faces warping after unwarping algorithm:
fr: Histogramme du gauchissement des faces intérieures après dégauchissement :

source: The faces have been renumbered before cutting. This case should not arise, because the mesh entities should be cut before renumbering.
fr: On a découpé les faces préalablement renumérotées. Ce cas ne devrait pas se produire, car on devrait découper les entités de maillage avant de les renuméroter.

source: Warped faces to cut
fr: Faces gauche a decouper

source: Face warping
fr: Gauchissement des faces

source: Warped faces after cutting
fr: Faces gauche apres decoupage

source: Cutting of warped faces requested --------------------------------- Maximum allowed angle (deg): %7.4f
fr: Découpage des faces gauches demandé ----------------------------------- Angle maximal autorisé (deg) : %7.4f

source: No face to cut. Verify the criterion if necessary.
fr: Aucune face à découper. Revoir le critère si nécessaire.

source: Interior faces: %12llu faces before cutting %12llu faces after cutting
fr: Faces intérieures : %12llu faces avant découpage %12llu faces après découpage

source: Boundary faces: %12llu faces before cutting %12llu faces after cutting
fr: Faces de bord : %12llu faces avant découpage %12llu faces après découpage

source: Number of cells per domain (histogramm):
fr: Nombre de cellules par domaine (histogramme) :

source: Partitioning by space-filling curve: %s.
fr: Partitionnement par courbe fractale : %s.

source: Morton (Z) curve: %.3g s
fr: Courbe de Morton (Z) : %.3g s

source: Peano-Hilbert curve: %.3g s
fr: Courbe de Peano-Hilbert : %.3g s

source: Partitioning %llu cells to %d domains (METIS_PartGraphRecursive).
fr: Partition de %llu cellules vers %d domaines (METIS_PartGraphRecursive).

source: Partitioning %llu cells to %d domains (METIS_PartGraphKway).
fr: Partition de %llu cellules vers %d domaines (METIS_PartGraphKway).

source: Total number of faces on parallel boundaries: %llu wall-clock time: %f s
fr: Nombre total de faces sur des frontières parallèles : %llu temps écoulé : %f s

source: Partitioning %llu cells to %d domains on %d ranks (ParMETIS_V3_PartKway).
fr: Partition de %llu cellules vers %d domaines sur %d rangs (ParMETIS_V3_PartKway).

source: Error in ParMETIS partitioning.
fr: Erreur au cours du partitionnement avec ParMETIS.

source: wall-clock time: %f s
fr: temps écoulé : %f s

source: Fatal error encountered by libScotch.
fr: Erreur bloquante rencontrée par libScotch.

source: Warning (libScotch):
fr: Attention (libScotch) :

source: Partitioning %llu cells to %d domains (SCOTCH_graphPart).
fr: Partition de %llu cellules vers %d domaines (SCOTCH_graphPart).

source: Partitioning %llu cells to %d domains on %d ranks (SCOTCH_dgraphPart).
fr: Partition de %llu cellules vers %d domaines sur %d rangs (SCOTCH_dgraphPart).

source: The partitioning directory cannot be created
fr: Le répertoire de partitionnement n'a pas pu être créé

source: No "%s" file available;
fr: Pas de fichier "%s" disponible;

source: The number of cells reported by file "%s" (%llu) does not correspond to those of the mesh (%llu).
fr: Le nombre de cellules indiqué par le fichier "%s" (%llu) ne correspond pas au maillage courant (%llu).

source: The number of ranks reported by file "%s" (%d) does not correspond to the current number of ranks (%d).
fr: Le nombre de rangs indiqué par le fichier "%s" (%d) ne correspond pas au nombre de rangs courant (%d).

source: Section of type <%s> on <%s> is unexpected.
fr: Section de type <%s> sur <%s> inattendue.

source: External libraries for partitioning:
fr: Bibliothèques externes pour le partitionnement :

source: Partitioning:
fr: Partitionnement :

source: preparing graph: %.3g s
fr: preparation du graphe ; %.3g s

source: Partitioning finished (%.3g s)
fr: Partitionnement terminé (%.3g s)

source: wall clock time: %.3g s
fr: temps écoulé : %.3g s

source: Number of modes: %d
fr: Nombre de modes : %d

source: Number of structures: %d
fr: Nombre de structures : %d

source: ------------------------------------------------------------- SEM INFO, inlet "%d"
fr: ------------------------------------------------------------- SEM INFO, entrée "%d"

source: Reading the LES inflow module restart file...
fr: Lecture du fichier de reprise pour le module d'entrée LES...

source: Abort while opening the LES inflow module restart file in read mode. Verify the existence and the name of the restart file: %s
fr: Arret à l'ouverture en lecture du fichier de reprise pour l'entrée LES. Vérifier l'existence et le nom du fichier de reprise de calcul: %s

source: Abort while reading the LES inflow module restart file. The number of boundary faces has been modified Verify that the restart file corresponds to the present study.
fr: Arret de lecture du fichier de reprise pour l'entrée LES. Le nombre de faces de bord a été modifié Vérifier que le fichier de reprise de calcul correspond bien au cas traité.

source: Abort while reading the LES inflow module restart file. The file %s does not seem to be a restart file for the LES inflow module. The calculation will not be run. Verify that the restart file corresponds to a restart file for the LES inflow module.
fr: Arret de lecture du fichier de reprise pour l'entrée LES. Le fichier %s ne semble pas etre un fichier de reprise de calcul pour l'entrée LES. Le calcul ne peut etre executé. Verifier que le fichier de reprise de calcul utilisé correspond bien à un fichier de reprise de calcul d'entrée LES.

source: Problem while reading section in the restart file for the LES inflow module: <%s> The calculation will not be run.
fr: Problème à la lecture de la rubrique dans le fichier de reprise de calcul du module entrée LES : <%s> Le calcul ne sera pas executé.

source: Abort while opening the LES inflow module restart file in write mode. Verify the existence and the name of the restart file: %s
fr: Arret à l'ouverture en écriture du fichier de reprise de calcul d'entrée LES. Vérifier l''existence et le nom du fichier de reprise de calcul: %s

source: Accumulated CPU time: %12.3f
fr: Temps CPU cumulé : %12.3f

source: Accumulated CPU time: local min: %12.3f local max: %12.3f mean: %12.3f
fr: Temps CPU cumulé : min local : %12.3f max local : %12.3f moyenne : %12.3f
