Repository: paulochon8616/CS4.0-EDL
Catalog: po/*.po
Languages: fr

source: WARNING The extended neighborhood is empty whereas the least-squares method on extended neighborhood for gradient computation is activated. This situation can arise in some particular cases (1D mesh). Verify that it is your case, otherwise contact support.
fr: ATTENTION Le voisinage étendu est nul alors que la méthode de calcul des gradients par moindres carrés sur support étendu est activée. Ceci peut arriver dans certains cas spécifiques (maillage 1D). Vérifiez que c'est bien votre cas, sinon contactez le support.

source: Extended neighborhood reduced by non-orthogonality -------------------------------------------------- Size of complete cell-cell connectivity: %12llu Size of filtered cell-cell conectivity: %12llu %llu connections removed, for a ratio of %4.2g %% used
fr: Limitation du voisinage étendu par non-orthogonalité ---------------------------------------------------- Taille de la connectivité cellules-cellules complète : %12llu Taille de la connectivité cellules-cellules filtrée : %12llu %llu connexions supprimées, soit un ratio de %4.2g %% utilisées

source: intensive
fr: intensif

source: extensive
fr: extensif

source: property
fr: propriété

source: postprocess
fr: post traitement

source: accumulator
fr: accumulateur

source: user
fr: utilisateur

source: Field "%s" may not be defined as both intensive and extensive.
fr: Le champ "%s" ne peut pas être à la fois extensif et intensif.

source: Mesh location %d associated with field "%s" has not been defined yet.
fr: Le support de maillage %d associé avec le champ "%s" n'a pas encore été défini.

source: Field "%s" with type flag %d has no value associated with key %d ("%s").
fr: Le champ "%s" avec indicateur de type %d n'a pas de valeur associée avec la clé %d ("%s").

source: Field keyword with id %d is not defined.
fr: Le mot clé de champs avec id %d n'est pas défini.

source: Error %d assigning integer value to Field "%s" with type flag %d with key %d ("%s").
fr: Erreur %d à l'association d'un entier au champ "%s" d'indicateur de type %d avec la clé %d ("%s").

source: Error %d assigning real value to Field "%s" with type flag %d with key %d ("%s").
fr: Erreur %d à l'association d'un réel au champ "%s" d'indicateur de type %d avec la clé %d ("%s").

source: Error %d assigning string value to Field "%s" with type flag %d with key %d ("%s").
fr: Erreur %d à l'association d'une chaîne au champ "%s" d'indicateur de type %d avec la clé %d ("%s").

source: Field with id %d is not defined.
fr: Le champ avec id %d n'est pas défini.

source: Field "%s" is not defined.
fr: Le champ "%s" n'est pas défini.

source: Field "%s" does not have a component "%s".
fr: Le champ "%s" n'a pas de composante "%s".

source: Field "%s" has keyword %d ("%s") of type "%c" and not "%c".
fr: Le champ "%s" a un mot clé %d ("%s") de type "%c" et non "%c".

source: Field %s with type flag %d has no value associated with key %d (%s).
fr: Le champ %s avec indicateur de type %d na pas de valeur associée au mot clé %d (%s).

source: Field
fr: Champ

source: Location
fr: Support

source: Fields of type: %s ---------------
fr: Champs de type : %s ----------------

source: Other fields: -------------
fr: Autres champs : ---------------

source: %s %s %s %s Type flag
fr: %s %s %s %s Indic. type

source: Field: "%s"
fr: Champ : "%s"

source: Location: %s
fr: Support : %s

source: Dimension: %d (non-interleaved)
fr: Dimension : %d (non entrelacé)

source: Dimension: %d (interleaved)
fr: Dimension : %d (entrelacé)

source: Values mapped from external definition
fr: Valeurs partagées avec définition externe

source: Associated key values:
fr: Valeurs de clés associées :

source: %-24s %-10d (default)
fr: %-24s %-10d (défaut)

source: %-24s %-10.3g (default)
fr: %-24s %-10.3g (défaut)

source: %-24s %-10s (default)
fr: %-24s %-10s (défaut)

source: %-24s: (default)
fr: %-24s: (défaut)

source: %-24s %-24p (default)
fr: %-24s %-24p (défaut)

source: Default
fr: Défaut

source: Defined field keys: -------------------
fr: Clés définies pour les champs : -------------------------------

source: %-24s %-12d integer %-4d
fr: %-24s %-12d entier %-4d

source: %-24s %-12.3g real %-4d
fr: %-24s %-12.3g réel %-4d

source: %-24s %-12s string %-4d
fr: %-24s %-12s chaîne %-4d

source: %-24s %-12s struct %-4d
fr: %-24s %-12s structure %-4d

source: Key: "%s", values per field ----
fr: clé: "%s", valeurs par champ ----

source: %s %-10d (default)
fr: %s %-10d (défaut)

source: %s %-10.3g (default)
fr: %s %-10.3g (défaut)

source: %s %-10s (default)
fr: %s %-10s (défaut)

source: %s (default)
fr: %s (défaut)

source: Defined key values per field: -----------------------------
fr: Valeurs de clés définies par champ : ------------------------------------

source: default
fr: défaut

source: standard input and output, serial access
fr: entrées/sorties standard, accès série

source: standard input and output, parallel access
fr: entrées/sorties standard, accès parallèle

source: non-collective MPI-IO, independent file open/close
fr: MPI-IO non collectif, ouverture/fermeture indépendante

source: non-collective MPI-IO, collective file open/close
fr: MPI-IO non collectif, ouverture/fermeture collective

source: collective MPI-IO
fr: MPI-IO collectif

source: explicit offsets
fr: positions explicites

source: individual file pointers
fr: pointeurs de fichiers individuels

source: Error writing file "%s": %s
fr: Erreur à l'écriture du fichier "%s" : %s

source: Error writing file "%s"
fr: Erreur à la lecture du fichier "%s"

source: MPI IO error for file: %s Error type: %s
fr: Erreur MPI IO pour le fichier : %s Type d'erreur : %s

source: I/O read method: %s
fr: méthode de lecture : %s

source: I/O write method: %s
fr: méthode d'écriture : %s

source: I/O read method: %s (%s)
fr: méthode de lecture : %s (%s)

source: I/O write method: %s (%s)
fr: méthode d'écriture : %s (%s)

source: hints:
fr: indications :

source: I/O rank step: %d
fr: pas des rangs E/S : %d

source: Error opening directory "%s": %s
fr: Erreur à l'ouverture du répertoire "%s" : %s

source: Error removing file "%s": %s
fr: Erreur à la suppression du fichier "%s" : %s

source: The %d periodic transformations of the halo do not comply with the main mesh transformations (numbering %d).
fr: Les %d transformations périodiques du halo ne correspondent pas à celles du maillage principal (au nombre de %d).

source: Error reading file: "%s". File format is not the correct version. The first 64 bytes expected contain: "%s" The first 64 bytes read contain: "%s"
fr: Erreur à la lecture du fichier : "%s". Le format du fichier n'est pas à la bonne version. Les 64 premiers octets attendus contiennent : "%s" Les 64 premiers octets lus contiennent : "%s"

source: Error reading file: "%s". The file contents are not of the expected type. "%s" was expected, "%s" was read.
fr: Erreur à la lecture du fichier : "%s. Le contenu du fichier n'est pas du type attendu. On attendait "%s" On a lu "%s".

source: Error writing the header of file: "%s".
fr: Erreur à l'écriture de l'entête du fichier : "%s".

source: Section read on "%s":
fr: Section lue sur "%s" :

source: Section written on "%s":
fr: Section écrite sur "%s" :

source: section name: "%s" number of elements: %llu
fr: nom de la rubrique : "%s" nombre d'éléments : %llu

source: element type name: "%s"
fr: nom du type d'élément : "%s"

source: (local)
fr: (locaux)

source: %d first and last elements%s:
fr: %d premiers et derniers éléments%s :

source: elements%s:
fr: éléments%s :

source: Error writing %llu bytes to file "%s".
fr: Erreur à l'écriture de %llu octets dans le fichier "%s".

source: %llu indexed records: (name, n_vals, location_id, index_id, n_loc_vals, type, embed, file_id, offset)
fr: %llu sections indexées : (nom, n_vals, id_support, id_index, n_vals_loc, type, inclus, id_fichier, position)

source: Reading file: %s
fr: Lecture du fichier : %s

source: Writing file: %s
fr: Écriture du fichier : %s

source: Finished reading: %s
fr: Fin de la lecture : %s

source: Finished writing: %s
fr: Fin de l'écriture : %s

source: Error reading file: "%s". Data type "%s" is not recognized.
fr: Erreur à la lecture du fichier : "%s". Le type de données "%s" n'est pas reconnu.

source: Error reading file: "%s". Type expected for section: "%s" is a signed integer and is not convertible from type read: "%s".
fr: Erreur à la lecture du fichier : "%s". Le type attendu pour la section : "%s" est un entier signé et n'est pas convertible à partir du type lu : "%s".

source: Error reading file: "%s". Type expected for section: "%s" is an unsigned integer and is not convertible from type read: "%s".
fr: Erreur à la lecture du fichier : "%s". Le type attendu pour la section : "%s" est un entier non signé et n'est pas convertible à partir du type lu : "%s".

source: Error reading file: "%s". Type expected for section: "%s" is "r4" or "r8" (real), and not "%s".
fr: Erreur à la lecture du fichier : "%s". Le type attendu pour la section : "%s" est "r4" ou "r8" (réel), et non "%s".

source: first element for next rank: %10llu : %12llu
fr: premier élement rang suivant : %10llu : %12llu

source: Code_Saturne IO files read:
fr: fichiers d'E/S Code_Saturne lus :

source: Code_Saturne IO files written:
fr: Fichiers d'E/S Code_Saturne écrits :

source: %s global: %12.5f s, %12.3f %ciB local: %12.5f s, %12.3f %ciB open: %12.5f s, %u open(s)
fr: %s global : %12.5f s, %12.3f %cio local : %12.5f s, %12.3f %cio ouvert : %12.5f s, %u fois

source: %s data: %12.5f s, %12.3f %ciB open: %12.5f s, %u open(s)
fr: %s données : %12.5f s, %12.3f %cio ouvert : %12.5f s, %u fois

source: file contents:
fr: contenu du fichier :

source: file: %s
fr: fichier : %s

source: contents: "%s"
fr: contenu : "%s"

source: MPI communicator: %ld
fr: Communicateur MPI : %ld

source: default header size: %lu header alignment: %lu body alignment: %lu verbosity level: %ld
fr: taille d'en-tête par défaut : %lu alignement des en-têtes : %lu alignement des corps : %lu niveau d'impression : %ld

source: Error opening log file: %s
fr: Erreur à l'ouverture du fichier journal : %s

source: time
fr: temps

source: calls
fr: appels

source: field
fr: champ

source: ** Computed fields on %s -------------------%.*s
fr: ** Champs calculés sur %s --------------------%.*s

source: set mean
fr: moy. ensemble

source: spatial mean
fr: moy. spatiale

source: ** Computed values on %s -------------------%.*s
fr: ** Valeurs calculées sur %s ----------------------%.*s

source: ** Clippings for computed fields -----------------------------
fr: ** "Clippings" des champs calculés -------------------------------

source: ** Clippings for auxiliary values ------------------------------
fr: ** "Clippings" de valeurs auxiliaires ----------------------------------

source: initial min
fr: min. init.

source: initial max
fr: max. init.

source: clips to min
fr: lim. à min.

source: clips to max
fr: lim. à max.

source: Physical model options ----------------------
fr: Options de modèle physique --------------------------

source: Measure set with id %d is not defined.
fr: Le jeu de mesures avec id %d n'est pas défini.

source: Interpol grid with id %d is not defined.
fr: La grille d'interpolation avec id %d n'est pas définie.

source: Measure set "%s" is not defined.
fr: Le jeu de mesures "%s" n'est pas défini.

source: Interpol grid "%s" is not defined.
fr: La grille d'interpolation "%s" n'est pas définie.

source: vectorization
fr: vectorisation

source: Usage: %s [options]
fr: Utilisation : %s [options]

source: Command line options:
fr: Options de la ligne de commandes :

source: --app-name <app_name> to name this code instance (default: working directory base name)
fr: --app-name <app_name> pour nommer cette instance du code (défaut : nom de base du répertoire de travail)

source: --benchmark elementary operations performance [--mpitrace] operations done only once for light MPI traces
fr: --benchmark performance des opérations élémentaires [--mpitrace] opérations effectuées une seule fois pour traces MPI légères

source: -h, --help this help message
fr: -h, --help appel de l'aide (cet affichage)

source: --mpi force use of MPI for parallelism or coupling (usually automatic, only required for undetermined MPI libraries)
fr: --mpi calcul parallèle ou couplé via MPI ; (généralement automatique, nécessaire uniquement pour des bibliothèques MPI inconnues)

source: --log output redirection for rank -1 or 0: 0: standard output 1: output in "listing" (default)
fr: --log redirection des sorties de rang -1 ou 0 : 0 : sortie standard 1 : sorties dans "listing" (défaut)

source: --logp output redirection for rank > 0: -1: remove output (default) 0: no redirection (if independant terminals, debugger type) 1: output in "listing_n<rang>"
fr: --logp redirection des sorties de rang > 0 : -1 : sorties supprimées (défaut) 0 : aucune redirection (si terminaux indépendants, type deboggeur) 1 : sorties dans "listing_n<rang>"

source: -p, --param <file_name> parameter file
fr: -p, --param <nom_du_fichier> fichier de paramètres

source: --preprocess mesh preprocessing mode
fr: --preprocess pré-traitement du maillage

source: -q, --quality mesh quality verification mode
fr: -q, --quality vérification de la qualité du maillage

source: --version print version number
fr: --version affiche le numéro de version

source: -wdir, --wdir <path> working directory
fr: -wdir, --wdir <chemin> répertoire de travail

source: Error switching to directory "%s": %s
fr: Erreur au changement de répertoire "%s" : %s

source: %s was built without MPI support, so option "%s" may not be used.
fr: %s a été construit sans support MPI, donc l'option "%s" n'est pas disponible.

source: Error loading parameter file "%s".
fr: Erreur à la lecture du fichier de paramètres "%s".

source: Error unloading library: %s.
fr: Erreur au déchargement de la bibliothèque : %s.

source: Freesteam support not available in this build.
fr: Le support de Freesteam n'est pas disponible sur cette installation.

source: Postprocessing output writers: ------------------------------
fr: Gestionnaires de sorties pour post traitement : -----------------------------------------------

source: every %12.5e s and at calculation end
fr: toutes les %12.5e s et à la fin du calcul

source: every %d time steps and at calculation end
fr: tous les %d pas de temps et à la fin du calcul

source: at calculation end
fr: à la fin du calcul

source: every %12.5e s
fr: toutes les %12.5e s

source: every %d time steps
fr: tous les %d pas de temps

source: %2d: name: %s directory: %s format: %s options: %s time dependency: %s output: %s
fr: %2d: nom: %s répertoire: %s format: %s options: %s dépendence en temps: %s sorties: %s

source: The requested post-processing writer number %d is not defined.
fr: Le gestionnaire de post traitement numéro %d demandé n'est pas défini.

source: The requested post-processing mesh number %d is not defined.
fr: Le maillage de post traitement numéro %d demandé n'est pas défini.

source: The requested post-processing mesh number must be < 0 (reserved) or > 0 (user).
fr: Le numéro de maillage de post traitement demandé doit être < 0 (réservé) ou > 0 (utilisateur).

source: The requested post-processing writer number must be < 0 (reserved) or > 0 (user).
fr: Le numéro de gestionnaire de post traitement demandé doit être < 0 (réservé) ou > 0 (utilisateur).

source: The mesh %d cannot be an alias of mesh %d, which is itself an alias of mesh %d.
fr: Le maillage %d ne peut être un alias du maillage %d, qui est lui-même déjà un alias du maillage %d.

source: edges
fr: arêtes

source: Post-processing mesh number %d has been aliased by mesh %d, so it may not be freed.
fr: Le maillage de post-traitement %d est référencé par le maillage %d, donc il ne peut être libéré.

source: Post-processing mesh number %d has been associated to writer %d which allows time-varying meshes, so it may not be freed.
fr: Le maillage de post-traitement %d a été associé au gestionnaire de post-traitement %d, qui permet des maillages dépendant du temps, donc il ne peut pas être libéré.

source: Fluid domain
fr: Domaine fluide

source: Boundary
fr: Bord

source: Particles
fr: Particules

source: Writing of "%s" (%s) summary: CPU time for meshes: %12.3f CPU time for variables: %12.3f CPU time forcing output: %12.3f Elapsed time for meshes: %12.3f Elapsed time for variables: %12.3f Elapsed time forcing output: %12.3f
fr: Bilan des écritures de "%s" (%s) : Temps CPU pour les maillages : %12.3f Temps CPU pour les champs : %12.3f Temps CPU de forçage des sorties : %12.3f Temps écoulé pour les maillages : %12.3f Temps écoulé pour les champs : %12.3f Temps écoulé de forçage des sorties : %12.3f

source: Calculation domain
fr: Domaine de calcul

source: Cutting warped faces (%.3g s)
fr: Découpage des faces gauches (%.3g s)

source: Mesh
fr: Maillage

source: No "%s" file or directory found.
fr: Aucun fichier ou répertoire "%s" trouvé.

source: Checking metadata from file: "%s"
fr: Lecture des méta-données du fichier : "%s"

source: Section of type <%s> on <%s> unexpected or of incorrect size
fr: Section de type <%s> sur <%s> inattendue ou de taille incorrecte

source: Reading metadata from file: "%s"
fr: Lecture des méta-données du fichier: "%s"

source: Section of type <%s> on <%s> has incorrect size (current: %llu, read: %llu, total: %llu.
fr: Section de type <%s> sur <%s> de taille incorrecte (courante : %llu, lu : %llu, total : %llu.

source: Section of type <%s> on <%s> has incorrect number of values per location.
fr: Section de type <%s> sur <%s> avec un nombre incorrect de valeurs par support.

source: User-defined Transformation matrix is not invertible: [[%12.5f %12.5f %12.5f %12.5f] [%12.5f %12.5f %12.5f %12.5f] [%12.5f %12.5f %12.5f %12.5f] [%12.5f %12.5f %12.5f %12.5f]]
fr: Matrice de transformation non inversible : %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f %12.5f

source: Section of type <%s> on <%s> unexpected or of incorrect size.
fr: Section de type <%s> sur <%s> inattendue ou de taille incorrecte.

source: Section of type <%s> on <%s> unexpected.
fr: Section de type <%s> sur <%s> inattendue.

source: sub-partitioning with LibScotch
fr: sous-partitionnement avec LibScotch

source: fill-reducing ordering with LibScotch
fr: renumérotation de matrice creuse avec LibScotch

source: sub-partitioning with METIS
fr: sous-partitionnement avec Metis

source: fill-reducing ordering with METIS
fr: renumérotation de matrice creuse avec METIS

source: Morton curve in local bounding box
fr: courbe de Morton dans boîte englobante locale

source: Hilbert curve in local bounding box
fr: courbe de Hilbert dans boîte englobante locale

source: none
fr: aucun

source: coloring, no shared cell in block
fr: coloriage, pas de cellule partagée dans un bloc

source: multipass
fr: multipasse

source: vectorizing
fr: vectorisation

source: no shared cell across threads
fr: pas de cellule partagée entre fils

source: no value
fr: aucune valeur

source: minimum value = %10llu
fr: valeur minimale = %10llu

source: maximum value = %10llu
fr: valeur maximale = %10llu

source: minimum value = %10.5e
fr: valeur minimale = %10.5e

source: maximum value = %10.5e
fr: valeur maximale = %10.5e

source: Vectorization for interior faces to cells gathers on %d/%d ranks
fr: Vectorization des assemblages faces vers cellules sur %d/%d rangs

source: Histogram of %s matrix bandwidth per rank:
fr: Histogramme de la largeur de bande de matrice %s sur les rangs :

source: Histogram of %s matrix profile/lines per rank:
fr: Histogramme du profil/lignes de matrice %s sur les rangs :

source: Matrix bandwidth for %s : %llu Matrix profile/lines for %s : %llu
fr: Largeur de bande de la matrice pour %s : %llu Profil/lignes de la matrice pour le %s : %llu

source: Histogram of thread pools size for %s per rank:
fr: Histogramme des nombres de threads pour les %s par rang :

source: Histogram of threading groups count for %s per rank:
fr: Histogramme du nombre de groupes de threads pour les %s par rang :

source: Histogram of thread imbalance for %s per rank:
fr: Histogramme du déséquilibre de threads pour les %s par rang :

source: Number of thread pools for %s : %d Number of threading groups for %s : %d Estimated thread imbalance for %s : %10.5e
fr: Nombre de threads pour les %s : %d Nombre de groupes de threads pour les %s : %d Déséquilibre de threads estimé pour les %s : %10.5e

source: Sub-partitioning cells to %d domains per rank (%s).
fr: Sous-partitionnement des cellules vers %d domaines par rang (%s).

source: Cell prenumbering (%s) failed.
fr: Échec de la pré-numérotation des cellules (%s).

source: Cell renumbering (%s) failed.
fr: Échec de la renumérotation des cellules (%s).

source: interior faces
fr: faces intérieures

source: boundary faces
fr: faces de bord

source: Checking interior faces renumbering...
fr: Vérification de la numérotation des faces internes...

source: Checking boundary faces renumbering...
fr: Vérification de la numérotation des faces de bord...

source: Mesh renumbering off.
fr: Renumérotation du maillage désactivée.

source: no
fr: non

source: yes
fr: oui

source: lowest id first
fr: id le plus bas en premier

source: highest id first
fr: id le plus haut en premier

source: renumbering for cells: pre-numbering: %s cells adjacent to ghost cells last: %s numbering: %s
fr: renumérotation des cellules : pré-numérotation %s cellules adjacentes aux halos en dernier : %s numérotation : %s

source: renumbering for interior faces: cell adjacency pre-ordering: %s faces adjacent to ghost cells last: %s numbering: %s
fr: renumérotation des faces internes : pré-ordonnancement par cellules adjacentes : %s faces adjacentes aux halos en dernier : %s numérotation : %s

source: renumbering for boundary faces: numbering: %s
fr: renumérotation des faces de bord : numérotation : %s

source: Renumbering mesh:
fr: Renumérotation du maillage:

source: volume mesh
fr: maillage volumique

source: =========================================================== ** Stop to avoid exceeding time allocation. ---------------------------------------- maximum time step number set to: %d ===========================================================
fr: ======================================================== ** Arrêt pour éviter de dépasser le temps alloué. ---------------------------------------------- numéro de pas de temps maximal mis à : %d ========================================================

source: =============================================================== ** Remaining time management ------------------------- Remaining time allocated to the job : ', %14.5e Estimated time for another time step : ', %14.5e mean time for a time step : ', %14.5e time for the previous time step : ', %14.5e security margin : ', %14.5e ===============================================================
fr: =============================================================== ** Gestion du temps restant ------------------------ Temps restant alloué à la tâche : ', %14.5e Temps estimé pour un nouveau pas de temps : ', %14.5e temps moyen par pas de temps : ', %14.5e temps pour le pas de temps précédent : ', %14.5e marge de sécurité : ', %14.5e ===============================================================

source: Location number %d given for restart file "%s" is not valid.
fr: Le numéro de support %d donné pour le fichier de reprise de calcul "%s" est invalide.

source: Restart file "%s" declares a location number %d but no location %d has been declared.
fr: Le fichier de reprise de calcul "%s" déclare un support numéro %d alors qu'aucun support numéro %d n'a été déclaré.
